"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 4000, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 1151, \"word_counts\": \"{\\\"hi\\\": 2, \\\"there\\\": 55, \\\"hey\\\": 1, \\\"hola\\\": 1, \\\"hello\\\": 1, \\\"wassup\\\": 1, \\\"aslam\\\": 1, \\\"u\\\": 1, \\\"alikum\\\": 1, \\\"aoa\\\": 1, \\\"how\\\": 112, \\\"are\\\": 226, \\\"you\\\": 53, \\\"doing\\\": 2, \\\"was\\\": 11, \\\"bye\\\": 2, \\\"see\\\": 5, \\\"later\\\": 1, \\\"goodbye\\\": 1, \\\"nice\\\": 1, \\\"chatting\\\": 1, \\\"to\\\": 57, \\\"till\\\": 1, \\\"next\\\": 1, \\\"time\\\": 9, \\\"allah\\\": 13, \\\"hafiz\\\": 1, \\\"thanks\\\": 3, \\\"thank\\\": 1, \\\"thats\\\": 1, \\\"helpful\\\": 2, \\\"awesome\\\": 1, \\\"for\\\": 36, \\\"helping\\\": 1, \\\"me\\\": 6, \\\"who\\\": 41, \\\"your\\\": 11, \\\"introduction\\\": 2, \\\"what\\\": 332, \\\"is\\\": 253, \\\"name\\\": 5, \\\"alsiraj\\\": 2, \\\"meant\\\": 7, \\\"by\\\": 11, \\\"busy\\\": 3, \\\"now\\\": 2, \\\"know\\\": 7, \\\"any\\\": 3, \\\"other\\\": 19, \\\"chatbots\\\": 1, \\\"do\\\": 55, \\\"chatbot\\\": 3, \\\"about\\\": 4, \\\"think\\\": 3, \\\"of\\\": 504, \\\"say\\\": 3, \\\"anything\\\": 1, \\\"whats\\\": 2, \\\"the\\\": 186, \\\"weather\\\": 2, \\\"age\\\": 8, \\\"boss\\\": 2, \\\"listen\\\": 6, \\\"music\\\": 4, \\\"musics\\\": 2, \\\"watch\\\": 4, \\\"movie\\\": 3, \\\"movies\\\": 1, \\\"where\\\": 19, \\\"live\\\": 6, \\\"which\\\": 14, \\\"languages\\\": 1, \\\"can\\\": 44, \\\"speak\\\": 1, \\\"many\\\": 67, \\\"people\\\": 2, \\\"talk\\\": 1, \\\"at\\\": 11, \\\"once\\\": 2, \\\"like\\\": 5, \\\"humans\\\": 6, \\\"why\\\": 37, \\\"great\\\": 6, \\\"good\\\": 1, \\\"love\\\": 3, \\\"could\\\": 1, \\\"help\\\": 2, \\\"provide\\\": 1, \\\"be\\\": 1, \\\"support\\\": 1, \\\"offered\\\": 1, \\\"islam\\\": 99, \\\"we\\\": 26, \\\"should\\\": 10, \\\"choose\\\": 1, \\\"follow\\\": 1, \\\"wordly\\\": 4, \\\"meaning\\\": 21, \\\"god\\\": 2, \\\"in\\\": 148, \\\"gods\\\": 1, \\\"names\\\": 10, \\\"anyone\\\": 4, \\\"not\\\": 8, \\\"with\\\": 5, \\\"eyes\\\": 2, \\\"cant\\\": 1, \\\"when\\\": 39, \\\"will\\\": 14, \\\"does\\\": 8, \\\"look\\\": 2, \\\"us\\\": 4, \\\"angels\\\": 13, \\\"created\\\": 3, \\\"from\\\": 15, \\\"made\\\": 9, \\\"up\\\": 1, \\\"roles\\\": 1, \\\"numbers\\\": 29, \\\"known\\\": 6, \\\"jibril\\\": 4, \\\"role\\\": 26, \\\"israfel\\\": 6, \\\"blow\\\": 6, \\\"trumpet\\\": 9, \\\"times\\\": 9, \\\"soor\\\": 9, \\\"azrael\\\": 4, \\\"mikail\\\": 4, \\\"kiraman\\\": 4, \\\"katibin\\\": 4, \\\"muqarrabun\\\": 4, \\\"munkar\\\": 4, \\\"and\\\": 44, \\\"nakir\\\": 4, \\\"archangel\\\": 4, \\\"gabriel\\\": 3, \\\"gabriell\\\": 1, \\\"angel\\\": 10, \\\"death\\\": 4, \\\"michael\\\": 4, \\\"jinns\\\": 24, \\\"concept\\\": 3, \\\"real\\\": 4, \\\"powers\\\": 4, \\\"types\\\": 20, \\\"list\\\": 8, \\\"eat\\\": 5, \\\"type\\\": 2, \\\"food\\\": 8, \\\"dwelling\\\": 2, \\\"places\\\": 3, \\\"muslims\\\": 22, \\\"or\\\": 28, \\\"disbelievers\\\": 4, \\\"believers\\\": 2, \\\"ghosts\\\": 24, \\\"prophets\\\": 14, \\\"total\\\": 2, \\\"quran\\\": 98, \\\"jesus\\\": 4, \\\"says\\\": 1, \\\"last\\\": 3, \\\"prophet\\\": 2, \\\"muhammad\\\": 27, \\\"pbuh\\\": 28, \\\"hazrat\\\": 19, \\\"born\\\": 1, \\\"birth\\\": 1, \\\"place\\\": 6, \\\"died\\\": 3, \\\"he\\\": 1, \\\"mother\\\": 5, \\\"pbuhs\\\": 3, \\\"mom\\\": 1, \\\"father\\\": 5, \\\"dad\\\": 1, \\\"were\\\": 1, \\\"parents\\\": 5, \\\"companions\\\": 3, \\\"sahabah\\\": 2, \\\"sahaba\\\": 2, \\\"a\\\": 26, \\\"muslim\\\": 18, \\\"means\\\": 1, \\\"become\\\": 8, \\\"words\\\": 2, \\\"holy\\\": 22, \\\"scrolls\\\": 3, \\\"scroll\\\": 12, \\\"abraham\\\": 3, \\\"moses\\\": 3, \\\"ibrahim\\\": 3, \\\"musa\\\": 3, \\\"books\\\": 12, \\\"scriptures\\\": 13, \\\"gospel\\\": 2, \\\"injil\\\": 2, \\\"zabur\\\": 2, \\\"torah\\\": 2, \\\"tawrat\\\": 2, \\\"koran\\\": 4, \\\"difference\\\": 12, \\\"between\\\": 12, \\\"proof\\\": 2, \\\"that\\\": 11, \\\"unchanged\\\": 1, \\\"corrupted\\\": 1, \\\"oldest\\\": 1, \\\"fragments\\\": 1, \\\"chapters\\\": 21, \\\"surah\\\": 10, \\\"number\\\": 18, \\\"verses\\\": 30, \\\"ayah\\\": 31, \\\"ayat\\\": 9, \\\"excluding\\\": 6, \\\"bismillah\\\": 12, \\\"including\\\": 6, \\\"ayats\\\": 22, \\\"sajdah\\\": 13, \\\"e\\\": 10, \\\"ayatesajdah\\\": 1, \\\"ayahesajdah\\\": 1, \\\"adoration\\\": 4, \\\"sajdad\\\": 1, \\\"makki\\\": 20, \\\"surahs\\\": 12, \\\"mecca\\\": 10, \\\"meccan\\\": 16, \\\"madani\\\": 20, \\\"madinan\\\": 20, \\\"imam\\\": 3, \\\"imams\\\": 5, \\\"four\\\": 2, \\\"qiyamah\\\": 4, \\\"coming\\\": 5, \\\"qayamah\\\": 5, \\\"qiyamat\\\": 5, \\\"day\\\": 12, \\\"judgment\\\": 5, \\\"qayamat\\\": 4, \\\"on\\\": 13, \\\"arrive\\\": 5, \\\"months\\\": 4, \\\"calendar\\\": 1, \\\"islamic\\\": 2, \\\"dest\\\": 1, \\\"best\\\": 4, \\\"week\\\": 1, \\\"month\\\": 5, \\\"year\\\": 3, \\\"halal\\\": 7, \\\"haram\\\": 7, \\\"animals\\\": 4, \\\"major\\\": 3, \\\"beliefs\\\": 3, \\\"study\\\": 2, \\\"seerah\\\": 2, \\\"kabah\\\": 6, \\\"built\\\": 2, \\\"one\\\": 6, \\\"location\\\": 1, \\\"qibla\\\": 6, \\\"first\\\": 48, \\\"current\\\": 1, \\\"masjid\\\": 2, \\\"mosque\\\": 2, \\\"purpose\\\": 4, \\\"worship\\\": 3, \\\"shahada\\\": 13, \\\"important\\\": 20, \\\"importance\\\": 38, \\\"pillar\\\": 49, \\\"profession\\\": 45, \\\"faith\\\": 45, \\\"parts\\\": 14, \\\"2\\\": 3, \\\"consist\\\": 3, \\\"conditions\\\": 16, \\\"have\\\": 9, \\\"shahadah\\\": 39, \\\"necessary\\\": 3, \\\"being\\\": 3, \\\"condition\\\": 81, \\\"explain\\\": 27, \\\"second\\\": 11, \\\"third\\\": 13, \\\"fourth\\\": 12, \\\"fifth\\\": 11, \\\"sixth\\\": 9, \\\"seventh\\\": 9, \\\"eighth\\\": 9, \\\"ninth\\\": 9, \\\"often\\\": 1, \\\"our\\\": 1, \\\"life\\\": 2, \\\"benefits\\\": 38, \\\"reciting\\\": 3, \\\"recite\\\": 4, \\\"most\\\": 3, \\\"makes\\\": 1, \\\"cannot\\\": 1, \\\"without\\\": 4, \\\"i\\\": 22, \\\"take\\\": 7, \\\"salah\\\": 28, \\\"salat\\\": 12, \\\"namaz\\\": 27, \\\"prayers\\\": 26, \\\"obligatory\\\": 4, \\\"fard\\\": 2, \\\"compulsory\\\": 16, \\\"wajib\\\": 2, \\\"sunni\\\": 2, \\\"sunnah\\\": 2, \\\"voluntary\\\": 2, \\\"nafl\\\": 2, \\\"five\\\": 9, \\\"perform\\\": 22, \\\"prayer\\\": 58, \\\"stepbystep\\\": 7, \\\"each\\\": 3, \\\"rakah\\\": 3, \\\"wudu\\\": 23, \\\"before\\\": 10, \\\"wo\\\": 3, \\\"5\\\": 6, \\\"different\\\": 7, \\\"postures\\\": 6, \\\"if\\\": 11, \\\"miss\\\": 4, \\\"get\\\": 3, \\\"missed\\\": 3, \\\"namz\\\": 1, \\\"pray\\\": 15, \\\"eid\\\": 25, \\\"my\\\": 7, \\\"area\\\": 3, \\\"men\\\": 9, \\\"women\\\": 12, \\\"benefit\\\": 15, \\\"fajar\\\": 5, \\\"zuhar\\\": 5, \\\"asar\\\": 5, \\\"maghrib\\\": 5, \\\"isha\\\": 5, \\\"rakats\\\": 10, \\\"than\\\": 3, \\\"daily\\\": 3, \\\"jumma\\\": 5, \\\"namazejummah\\\": 9, \\\"jummah\\\": 7, \\\"friday\\\": 5, \\\"so\\\": 1, \\\"steps\\\": 4, \\\"offer\\\": 4, \\\"home\\\": 8, \\\"namazejumma\\\": 2, \\\"tahajjud\\\": 10, \\\"prepare\\\": 1, \\\"preparations\\\": 1, \\\"tarawih\\\": 13, \\\"rakat\\\": 1, \\\"whole\\\": 1, \\\"during\\\": 17, \\\"hold\\\": 1, \\\"while\\\": 11, \\\"praying\\\": 6, \\\"lead\\\": 1, \\\"special\\\": 3, \\\"dua\\\": 4, \\\"reward\\\": 2, \\\"perpare\\\": 2, \\\"missing\\\": 1, \\\"individually\\\": 2, \\\"timings\\\": 2, \\\"pay\\\": 2, \\\"fitrana\\\": 4, \\\"fitra\\\": 2, \\\"something\\\": 2, \\\"eating\\\": 1, \\\"eidulfitr\\\": 2, \\\"eiduladha\\\": 2, \\\"required\\\": 2, \\\"performing\\\": 4, \\\"break\\\": 7, \\\"change\\\": 2, \\\"clothes\\\": 3, \\\"wudhu\\\": 3, \\\"over\\\": 3, \\\"socks\\\": 3, \\\"ghusl\\\": 14, \\\"step\\\": 4, \\\"acts\\\": 7, \\\"considered\\\": 3, \\\"appropriate\\\": 2, \\\"taking\\\": 2, \\\"inappropriate\\\": 1, \\\"water\\\": 6, \\\"available\\\": 4, \\\"tayammum\\\": 13, \\\"situations\\\": 3, \\\"done\\\": 2, \\\"after\\\": 4, \\\"making\\\": 3, \\\"nullifies\\\": 2, \\\"laylatalqadr\\\": 2, \\\"laylat\\\": 6, \\\"alqadr\\\": 6, \\\"rewards\\\": 3, \\\"long\\\": 2, \\\"zakat\\\": 29, \\\"charity\\\": 2, \\\"vs\\\": 1, \\\"imprtance\\\": 5, \\\"principals\\\": 2, \\\"giving\\\": 2, \\\"almal\\\": 2, \\\"alfitr\\\": 2, \\\"distribution\\\": 2, \\\"distribute\\\": 1, \\\"recipients\\\": 2, \\\"nisab\\\": 2, \\\"much\\\": 4, \\\"gold\\\": 2, \\\"silver\\\": 2, \\\"wealth\\\": 2, \\\"ushr\\\": 2, \\\"sayam\\\": 3, \\\"roza\\\": 12, \\\"sawm\\\": 10, \\\"mportance\\\": 1, \\\"fasting\\\": 27, \\\"excused\\\": 6, \\\"excluded\\\": 9, \\\"ramadan\\\": 5, \\\"actions\\\": 9, \\\"invalidate\\\": 11, \\\"nullify\\\": 9, \\\"fast\\\": 20, \\\"tablets\\\": 2, \\\"drops\\\": 2, \\\"injections\\\": 2, \\\"patches\\\": 2, \\\"whilst\\\": 2, \\\"having\\\": 2, \\\"dialysis\\\": 2, \\\"nose\\\": 3, \\\"bleeds\\\": 3, \\\"use\\\": 5, \\\"mouthwash\\\": 2, \\\"gargles\\\": 2, \\\"creams\\\": 2, \\\"ointments\\\": 2, \\\"diabetes\\\": 3, \\\"medical\\\": 3, \\\"an\\\": 1, \\\"inhaler\\\": 2, \\\"swimming\\\": 1, \\\"breaks\\\": 1, \\\"swiming\\\": 1, \\\"smoke\\\": 2, \\\"smoking\\\": 1, \\\"brush\\\": 3, \\\"teeth\\\": 3, \\\"kids\\\": 1, \\\"bath\\\": 2, \\\"days\\\": 2, \\\"forbidden\\\": 6, \\\"4\\\": 1, \\\"reasons\\\": 2, \\\"suhur\\\": 2, \\\"iftar\\\": 2, \\\"festival\\\": 1, \\\"celebrates\\\": 1, \\\"completion\\\": 1, \\\"actual\\\": 1, \\\"jihad\\\": 14, \\\"two\\\": 1, \\\"greater\\\": 8, \\\"teaches\\\": 2, \\\"learn\\\": 2, \\\"expects\\\": 2, \\\"lesser\\\": 2, \\\"gum\\\": 1, \\\"hajj\\\": 39, \\\"mean\\\": 1, \\\"word\\\": 1, \\\"his\\\": 2, \\\"enough\\\": 1, \\\"pilgrimage\\\": 6, \\\"essentail\\\": 2, \\\"whom\\\": 2, \\\"rituals\\\": 2, \\\"umrah\\\": 4, \\\"duration\\\": 2, \\\"occur\\\": 2, \\\"same\\\": 2, \\\"dates\\\": 2, \\\"every\\\": 2, \\\"did\\\": 2, \\\"clothing\\\": 7, \\\"rules\\\": 3, \\\"woman\\\": 2, \\\"alone\\\": 2, \\\"limit\\\": 2, \\\"cover\\\": 2, \\\"face\\\": 2, \\\"non\\\": 1, \\\"go\\\": 1, \\\"person\\\": 1, \\\"ihram\\\": 18, \\\"likelihood\\\": 1, \\\"bleeding\\\": 1, \\\"men\\\\u2019s\\\": 1, \\\"wear\\\": 2, \\\"sleep\\\": 2, \\\"these\\\": 1, \\\"state\\\": 5, \\\"permitted\\\": 2, \\\"youve\\\": 1, \\\"act\\\": 2, \\\"restrictions\\\": 2, \\\"lifted\\\": 2}\", \"word_docs\": \"{\\\"there\\\": 55, \\\"hi\\\": 2, \\\"hey\\\": 1, \\\"hola\\\": 1, \\\"hello\\\": 1, \\\"wassup\\\": 1, \\\"aslam\\\": 1, \\\"u\\\": 1, \\\"alikum\\\": 1, \\\"aoa\\\": 1, \\\"how\\\": 112, \\\"are\\\": 224, \\\"you\\\": 53, \\\"doing\\\": 2, \\\"was\\\": 11, \\\"bye\\\": 2, \\\"later\\\": 1, \\\"see\\\": 5, \\\"goodbye\\\": 1, \\\"nice\\\": 1, \\\"to\\\": 57, \\\"chatting\\\": 1, \\\"time\\\": 9, \\\"next\\\": 1, \\\"till\\\": 1, \\\"allah\\\": 13, \\\"hafiz\\\": 1, \\\"thanks\\\": 3, \\\"thank\\\": 1, \\\"thats\\\": 1, \\\"helpful\\\": 2, \\\"awesome\\\": 1, \\\"me\\\": 6, \\\"for\\\": 36, \\\"helping\\\": 1, \\\"who\\\": 41, \\\"your\\\": 11, \\\"introduction\\\": 2, \\\"name\\\": 5, \\\"what\\\": 332, \\\"is\\\": 249, \\\"alsiraj\\\": 2, \\\"meant\\\": 7, \\\"by\\\": 11, \\\"busy\\\": 3, \\\"now\\\": 2, \\\"any\\\": 3, \\\"chatbots\\\": 1, \\\"other\\\": 18, \\\"know\\\": 7, \\\"do\\\": 54, \\\"chatbot\\\": 3, \\\"about\\\": 4, \\\"of\\\": 425, \\\"think\\\": 3, \\\"anything\\\": 1, \\\"say\\\": 3, \\\"weather\\\": 2, \\\"the\\\": 164, \\\"whats\\\": 2, \\\"age\\\": 8, \\\"boss\\\": 2, \\\"listen\\\": 6, \\\"music\\\": 4, \\\"musics\\\": 2, \\\"watch\\\": 4, \\\"movie\\\": 3, \\\"movies\\\": 1, \\\"where\\\": 19, \\\"live\\\": 6, \\\"which\\\": 14, \\\"can\\\": 44, \\\"speak\\\": 1, \\\"languages\\\": 1, \\\"many\\\": 67, \\\"once\\\": 2, \\\"at\\\": 11, \\\"people\\\": 2, \\\"talk\\\": 1, \\\"humans\\\": 6, \\\"like\\\": 5, \\\"why\\\": 36, \\\"great\\\": 6, \\\"good\\\": 1, \\\"love\\\": 3, \\\"help\\\": 2, \\\"could\\\": 1, \\\"provide\\\": 1, \\\"be\\\": 1, \\\"offered\\\": 1, \\\"support\\\": 1, \\\"islam\\\": 99, \\\"choose\\\": 1, \\\"should\\\": 10, \\\"we\\\": 23, \\\"follow\\\": 1, \\\"wordly\\\": 4, \\\"meaning\\\": 21, \\\"in\\\": 148, \\\"god\\\": 2, \\\"gods\\\": 1, \\\"names\\\": 10, \\\"anyone\\\": 4, \\\"not\\\": 8, \\\"with\\\": 5, \\\"eyes\\\": 2, \\\"cant\\\": 1, \\\"when\\\": 39, \\\"will\\\": 14, \\\"look\\\": 2, \\\"does\\\": 8, \\\"us\\\": 4, \\\"angels\\\": 13, \\\"created\\\": 3, \\\"from\\\": 15, \\\"up\\\": 1, \\\"made\\\": 9, \\\"roles\\\": 1, \\\"numbers\\\": 29, \\\"known\\\": 6, \\\"jibril\\\": 4, \\\"role\\\": 26, \\\"israfel\\\": 6, \\\"blow\\\": 6, \\\"trumpet\\\": 8, \\\"times\\\": 9, \\\"soor\\\": 8, \\\"azrael\\\": 4, \\\"mikail\\\": 4, \\\"kiraman\\\": 4, \\\"katibin\\\": 4, \\\"muqarrabun\\\": 4, \\\"nakir\\\": 4, \\\"and\\\": 44, \\\"munkar\\\": 4, \\\"archangel\\\": 4, \\\"gabriel\\\": 3, \\\"gabriell\\\": 1, \\\"angel\\\": 10, \\\"death\\\": 4, \\\"michael\\\": 4, \\\"jinns\\\": 24, \\\"concept\\\": 3, \\\"real\\\": 4, \\\"powers\\\": 4, \\\"types\\\": 20, \\\"list\\\": 8, \\\"eat\\\": 5, \\\"type\\\": 2, \\\"food\\\": 8, \\\"dwelling\\\": 2, \\\"places\\\": 3, \\\"muslims\\\": 22, \\\"disbelievers\\\": 4, \\\"or\\\": 28, \\\"believers\\\": 2, \\\"ghosts\\\": 24, \\\"prophets\\\": 14, \\\"total\\\": 2, \\\"quran\\\": 98, \\\"jesus\\\": 4, \\\"says\\\": 1, \\\"last\\\": 3, \\\"prophet\\\": 2, \\\"pbuh\\\": 28, \\\"muhammad\\\": 27, \\\"born\\\": 1, \\\"hazrat\\\": 19, \\\"birth\\\": 1, \\\"place\\\": 6, \\\"died\\\": 3, \\\"he\\\": 1, \\\"mother\\\": 5, \\\"pbuhs\\\": 3, \\\"mom\\\": 1, \\\"father\\\": 5, \\\"dad\\\": 1, \\\"were\\\": 1, \\\"parents\\\": 5, \\\"companions\\\": 3, \\\"sahabah\\\": 2, \\\"sahaba\\\": 2, \\\"muslim\\\": 18, \\\"a\\\": 26, \\\"means\\\": 1, \\\"become\\\": 8, \\\"words\\\": 2, \\\"holy\\\": 22, \\\"scrolls\\\": 3, \\\"scroll\\\": 12, \\\"abraham\\\": 3, \\\"moses\\\": 3, \\\"ibrahim\\\": 3, \\\"musa\\\": 3, \\\"books\\\": 12, \\\"scriptures\\\": 13, \\\"gospel\\\": 2, \\\"injil\\\": 2, \\\"zabur\\\": 2, \\\"torah\\\": 2, \\\"tawrat\\\": 2, \\\"koran\\\": 4, \\\"difference\\\": 12, \\\"between\\\": 12, \\\"unchanged\\\": 1, \\\"that\\\": 11, \\\"proof\\\": 2, \\\"corrupted\\\": 1, \\\"fragments\\\": 1, \\\"oldest\\\": 1, \\\"chapters\\\": 21, \\\"surah\\\": 10, \\\"number\\\": 18, \\\"verses\\\": 30, \\\"ayah\\\": 31, \\\"ayat\\\": 9, \\\"excluding\\\": 6, \\\"bismillah\\\": 12, \\\"including\\\": 6, \\\"ayats\\\": 22, \\\"sajdah\\\": 13, \\\"e\\\": 10, \\\"ayatesajdah\\\": 1, \\\"ayahesajdah\\\": 1, \\\"adoration\\\": 4, \\\"sajdad\\\": 1, \\\"makki\\\": 20, \\\"surahs\\\": 12, \\\"mecca\\\": 10, \\\"meccan\\\": 16, \\\"madani\\\": 20, \\\"madinan\\\": 20, \\\"imam\\\": 3, \\\"imams\\\": 5, \\\"four\\\": 2, \\\"qiyamah\\\": 4, \\\"coming\\\": 5, \\\"qayamah\\\": 5, \\\"qiyamat\\\": 5, \\\"judgment\\\": 5, \\\"day\\\": 11, \\\"qayamat\\\": 4, \\\"arrive\\\": 5, \\\"on\\\": 13, \\\"months\\\": 4, \\\"calendar\\\": 1, \\\"islamic\\\": 2, \\\"dest\\\": 1, \\\"best\\\": 4, \\\"week\\\": 1, \\\"month\\\": 5, \\\"year\\\": 3, \\\"halal\\\": 7, \\\"haram\\\": 7, \\\"animals\\\": 4, \\\"major\\\": 3, \\\"beliefs\\\": 3, \\\"study\\\": 2, \\\"seerah\\\": 2, \\\"kabah\\\": 6, \\\"built\\\": 2, \\\"one\\\": 6, \\\"location\\\": 1, \\\"qibla\\\": 6, \\\"first\\\": 45, \\\"current\\\": 1, \\\"masjid\\\": 2, \\\"mosque\\\": 2, \\\"worship\\\": 3, \\\"purpose\\\": 4, \\\"important\\\": 19, \\\"shahada\\\": 13, \\\"importance\\\": 38, \\\"pillar\\\": 49, \\\"profession\\\": 43, \\\"faith\\\": 43, \\\"parts\\\": 14, \\\"2\\\": 3, \\\"consist\\\": 3, \\\"have\\\": 9, \\\"conditions\\\": 16, \\\"shahadah\\\": 39, \\\"necessary\\\": 3, \\\"being\\\": 3, \\\"condition\\\": 81, \\\"explain\\\": 27, \\\"second\\\": 11, \\\"third\\\": 13, \\\"fourth\\\": 12, \\\"fifth\\\": 11, \\\"sixth\\\": 9, \\\"seventh\\\": 9, \\\"eighth\\\": 9, \\\"ninth\\\": 9, \\\"often\\\": 1, \\\"our\\\": 1, \\\"life\\\": 2, \\\"reciting\\\": 3, \\\"benefits\\\": 38, \\\"recite\\\": 4, \\\"most\\\": 3, \\\"makes\\\": 1, \\\"cannot\\\": 1, \\\"without\\\": 4, \\\"take\\\": 7, \\\"i\\\": 21, \\\"salah\\\": 28, \\\"salat\\\": 12, \\\"namaz\\\": 27, \\\"prayers\\\": 23, \\\"obligatory\\\": 4, \\\"fard\\\": 2, \\\"compulsory\\\": 16, \\\"wajib\\\": 2, \\\"sunni\\\": 2, \\\"sunnah\\\": 2, \\\"nafl\\\": 2, \\\"voluntary\\\": 2, \\\"five\\\": 9, \\\"perform\\\": 22, \\\"prayer\\\": 58, \\\"stepbystep\\\": 7, \\\"each\\\": 3, \\\"rakah\\\": 3, \\\"wudu\\\": 23, \\\"before\\\": 10, \\\"wo\\\": 3, \\\"5\\\": 6, \\\"postures\\\": 6, \\\"different\\\": 7, \\\"miss\\\": 4, \\\"if\\\": 11, \\\"missed\\\": 3, \\\"get\\\": 3, \\\"namz\\\": 1, \\\"eid\\\": 25, \\\"pray\\\": 15, \\\"my\\\": 7, \\\"area\\\": 3, \\\"men\\\": 9, \\\"women\\\": 12, \\\"fajar\\\": 5, \\\"benefit\\\": 15, \\\"zuhar\\\": 5, \\\"asar\\\": 5, \\\"maghrib\\\": 5, \\\"isha\\\": 5, \\\"rakats\\\": 10, \\\"than\\\": 3, \\\"daily\\\": 3, \\\"jumma\\\": 5, \\\"namazejummah\\\": 9, \\\"jummah\\\": 7, \\\"so\\\": 1, \\\"friday\\\": 5, \\\"offer\\\": 4, \\\"steps\\\": 4, \\\"home\\\": 8, \\\"namazejumma\\\": 2, \\\"tahajjud\\\": 10, \\\"prepare\\\": 1, \\\"preparations\\\": 1, \\\"tarawih\\\": 13, \\\"rakat\\\": 1, \\\"whole\\\": 1, \\\"during\\\": 17, \\\"praying\\\": 6, \\\"hold\\\": 1, \\\"while\\\": 11, \\\"lead\\\": 1, \\\"special\\\": 3, \\\"dua\\\": 4, \\\"reward\\\": 2, \\\"perpare\\\": 2, \\\"missing\\\": 1, \\\"individually\\\": 2, \\\"timings\\\": 2, \\\"pay\\\": 2, \\\"fitra\\\": 2, \\\"fitrana\\\": 4, \\\"something\\\": 2, \\\"eating\\\": 1, \\\"eidulfitr\\\": 2, \\\"eiduladha\\\": 2, \\\"required\\\": 2, \\\"performing\\\": 4, \\\"break\\\": 7, \\\"clothes\\\": 3, \\\"change\\\": 2, \\\"socks\\\": 3, \\\"over\\\": 3, \\\"wudhu\\\": 3, \\\"ghusl\\\": 14, \\\"step\\\": 2, \\\"taking\\\": 2, \\\"considered\\\": 3, \\\"appropriate\\\": 2, \\\"acts\\\": 7, \\\"inappropriate\\\": 1, \\\"available\\\": 4, \\\"water\\\": 6, \\\"tayammum\\\": 13, \\\"done\\\": 2, \\\"situations\\\": 3, \\\"after\\\": 4, \\\"making\\\": 3, \\\"nullifies\\\": 2, \\\"laylatalqadr\\\": 2, \\\"laylat\\\": 6, \\\"rewards\\\": 3, \\\"alqadr\\\": 6, \\\"long\\\": 2, \\\"zakat\\\": 29, \\\"charity\\\": 2, \\\"vs\\\": 1, \\\"imprtance\\\": 5, \\\"principals\\\": 2, \\\"giving\\\": 2, \\\"almal\\\": 2, \\\"alfitr\\\": 2, \\\"distribution\\\": 2, \\\"distribute\\\": 1, \\\"recipients\\\": 2, \\\"nisab\\\": 2, \\\"much\\\": 4, \\\"gold\\\": 2, \\\"silver\\\": 2, \\\"wealth\\\": 2, \\\"ushr\\\": 2, \\\"roza\\\": 12, \\\"sayam\\\": 3, \\\"sawm\\\": 10, \\\"mportance\\\": 1, \\\"fasting\\\": 27, \\\"excluded\\\": 9, \\\"ramadan\\\": 5, \\\"excused\\\": 6, \\\"nullify\\\": 9, \\\"fast\\\": 20, \\\"invalidate\\\": 11, \\\"actions\\\": 9, \\\"injections\\\": 2, \\\"whilst\\\": 2, \\\"drops\\\": 2, \\\"patches\\\": 2, \\\"tablets\\\": 2, \\\"having\\\": 2, \\\"dialysis\\\": 2, \\\"bleeds\\\": 3, \\\"nose\\\": 3, \\\"mouthwash\\\": 2, \\\"gargles\\\": 2, \\\"use\\\": 5, \\\"ointments\\\": 2, \\\"creams\\\": 2, \\\"medical\\\": 3, \\\"diabetes\\\": 3, \\\"an\\\": 1, \\\"inhaler\\\": 2, \\\"breaks\\\": 1, \\\"swimming\\\": 1, \\\"swiming\\\": 1, \\\"smoke\\\": 2, \\\"smoking\\\": 1, \\\"brush\\\": 3, \\\"teeth\\\": 3, \\\"kids\\\": 1, \\\"bath\\\": 2, \\\"days\\\": 2, \\\"forbidden\\\": 6, \\\"4\\\": 1, \\\"reasons\\\": 2, \\\"suhur\\\": 2, \\\"iftar\\\": 2, \\\"festival\\\": 1, \\\"completion\\\": 1, \\\"celebrates\\\": 1, \\\"jihad\\\": 14, \\\"actual\\\": 1, \\\"two\\\": 1, \\\"greater\\\": 8, \\\"teaches\\\": 2, \\\"learn\\\": 2, \\\"expects\\\": 2, \\\"lesser\\\": 2, \\\"gum\\\": 1, \\\"hajj\\\": 39, \\\"mean\\\": 1, \\\"word\\\": 1, \\\"his\\\": 2, \\\"enough\\\": 1, \\\"pilgrimage\\\": 6, \\\"essentail\\\": 2, \\\"whom\\\": 2, \\\"rituals\\\": 2, \\\"umrah\\\": 4, \\\"duration\\\": 2, \\\"dates\\\": 2, \\\"every\\\": 2, \\\"occur\\\": 2, \\\"same\\\": 2, \\\"did\\\": 2, \\\"clothing\\\": 7, \\\"rules\\\": 3, \\\"woman\\\": 2, \\\"alone\\\": 2, \\\"limit\\\": 2, \\\"face\\\": 2, \\\"cover\\\": 2, \\\"non\\\": 1, \\\"go\\\": 1, \\\"person\\\": 1, \\\"bleeding\\\": 1, \\\"ihram\\\": 18, \\\"likelihood\\\": 1, \\\"wear\\\": 2, \\\"men\\\\u2019s\\\": 1, \\\"sleep\\\": 2, \\\"these\\\": 1, \\\"state\\\": 5, \\\"permitted\\\": 2, \\\"youve\\\": 1, \\\"act\\\": 2, \\\"restrictions\\\": 2, \\\"lifted\\\": 2}\", \"index_docs\": \"{\\\"14\\\": 55, \\\"308\\\": 2, \\\"426\\\": 1, \\\"427\\\": 1, \\\"428\\\": 1, \\\"429\\\": 1, \\\"430\\\": 1, \\\"431\\\": 1, \\\"432\\\": 1, \\\"433\\\": 1, \\\"7\\\": 112, \\\"4\\\": 224, \\\"16\\\": 53, \\\"309\\\": 2, \\\"102\\\": 11, \\\"310\\\": 2, \\\"434\\\": 1, \\\"182\\\": 5, \\\"435\\\": 1, \\\"436\\\": 1, \\\"13\\\": 57, \\\"437\\\": 1, \\\"122\\\": 9, \\\"439\\\": 1, \\\"438\\\": 1, \\\"82\\\": 13, \\\"440\\\": 1, \\\"251\\\": 3, \\\"441\\\": 1, \\\"442\\\": 1, \\\"311\\\": 2, \\\"443\\\": 1, \\\"159\\\": 6, \\\"30\\\": 36, \\\"444\\\": 1, \\\"23\\\": 41, \\\"103\\\": 11, \\\"312\\\": 2, \\\"183\\\": 5, \\\"2\\\": 332, \\\"3\\\": 249, \\\"313\\\": 2, \\\"147\\\": 7, \\\"104\\\": 11, \\\"252\\\": 3, \\\"314\\\": 2, \\\"253\\\": 3, \\\"445\\\": 1, \\\"63\\\": 18, \\\"148\\\": 7, \\\"15\\\": 54, \\\"254\\\": 3, \\\"208\\\": 4, \\\"1\\\": 425, \\\"255\\\": 3, \\\"446\\\": 1, \\\"256\\\": 3, \\\"316\\\": 2, \\\"5\\\": 164, \\\"315\\\": 2, \\\"139\\\": 8, \\\"317\\\": 2, \\\"160\\\": 6, \\\"209\\\": 4, \\\"318\\\": 2, \\\"210\\\": 4, \\\"257\\\": 3, \\\"447\\\": 1, \\\"64\\\": 19, \\\"161\\\": 6, \\\"76\\\": 14, \\\"21\\\": 44, \\\"449\\\": 1, \\\"448\\\": 1, \\\"11\\\": 67, \\\"320\\\": 2, \\\"105\\\": 11, \\\"319\\\": 2, \\\"450\\\": 1, \\\"162\\\": 6, \\\"184\\\": 5, \\\"29\\\": 36, \\\"163\\\": 6, \\\"451\\\": 1, \\\"258\\\": 3, \\\"321\\\": 2, \\\"452\\\": 1, \\\"453\\\": 1, \\\"454\\\": 1, \\\"456\\\": 1, \\\"455\\\": 1, \\\"8\\\": 99, \\\"457\\\": 1, \\\"112\\\": 10, \\\"42\\\": 23, \\\"458\\\": 1, \\\"211\\\": 4, \\\"55\\\": 21, \\\"6\\\": 148, \\\"322\\\": 2, \\\"459\\\": 1, \\\"113\\\": 10, \\\"212\\\": 4, \\\"140\\\": 8, \\\"185\\\": 5, \\\"323\\\": 2, \\\"460\\\": 1, \\\"24\\\": 39, \\\"77\\\": 14, \\\"324\\\": 2, \\\"141\\\": 8, \\\"213\\\": 4, \\\"83\\\": 13, \\\"259\\\": 3, \\\"73\\\": 15, \\\"461\\\": 1, \\\"123\\\": 9, \\\"462\\\": 1, \\\"33\\\": 29, \\\"164\\\": 6, \\\"214\\\": 4, \\\"43\\\": 26, \\\"165\\\": 6, \\\"166\\\": 6, \\\"124\\\": 8, \\\"125\\\": 9, \\\"126\\\": 8, \\\"215\\\": 4, \\\"216\\\": 4, \\\"217\\\": 4, \\\"218\\\": 4, \\\"219\\\": 4, \\\"221\\\": 4, \\\"22\\\": 44, \\\"220\\\": 4, \\\"222\\\": 4, \\\"260\\\": 3, \\\"463\\\": 1, \\\"114\\\": 10, \\\"223\\\": 4, \\\"224\\\": 4, \\\"47\\\": 24, \\\"261\\\": 3, \\\"225\\\": 4, \\\"226\\\": 4, \\\"57\\\": 20, \\\"142\\\": 8, \\\"186\\\": 5, \\\"325\\\": 2, \\\"143\\\": 8, \\\"326\\\": 2, \\\"262\\\": 3, \\\"50\\\": 22, \\\"227\\\": 4, \\\"35\\\": 28, \\\"327\\\": 2, \\\"48\\\": 24, \\\"78\\\": 14, \\\"328\\\": 2, \\\"9\\\": 98, \\\"228\\\": 4, \\\"464\\\": 1, \\\"263\\\": 3, \\\"329\\\": 2, \\\"36\\\": 28, \\\"38\\\": 27, \\\"465\\\": 1, \\\"65\\\": 19, \\\"466\\\": 1, \\\"167\\\": 6, \\\"264\\\": 3, \\\"467\\\": 1, \\\"187\\\": 5, \\\"265\\\": 3, \\\"468\\\": 1, \\\"188\\\": 5, \\\"469\\\": 1, \\\"470\\\": 1, \\\"189\\\": 5, \\\"266\\\": 3, \\\"330\\\": 2, \\\"331\\\": 2, \\\"66\\\": 18, \\\"44\\\": 26, \\\"471\\\": 1, \\\"144\\\": 8, \\\"332\\\": 2, \\\"51\\\": 22, \\\"267\\\": 3, \\\"91\\\": 12, \\\"268\\\": 3, \\\"269\\\": 3, \\\"270\\\": 3, \\\"271\\\": 3, \\\"92\\\": 12, \\\"84\\\": 13, \\\"333\\\": 2, \\\"334\\\": 2, \\\"335\\\": 2, \\\"336\\\": 2, \\\"337\\\": 2, \\\"229\\\": 4, \\\"93\\\": 12, \\\"94\\\": 12, \\\"472\\\": 1, \\\"106\\\": 11, \\\"338\\\": 2, \\\"473\\\": 1, \\\"475\\\": 1, \\\"474\\\": 1, \\\"56\\\": 21, \\\"115\\\": 10, \\\"67\\\": 18, \\\"32\\\": 30, \\\"31\\\": 31, \\\"127\\\": 9, \\\"168\\\": 6, \\\"95\\\": 12, \\\"169\\\": 6, \\\"52\\\": 22, \\\"85\\\": 13, \\\"116\\\": 10, \\\"476\\\": 1, \\\"477\\\": 1, \\\"230\\\": 4, \\\"478\\\": 1, \\\"58\\\": 20, \\\"96\\\": 12, \\\"117\\\": 10, \\\"70\\\": 16, \\\"59\\\": 20, \\\"60\\\": 20, \\\"272\\\": 3, \\\"190\\\": 5, \\\"339\\\": 2, \\\"231\\\": 4, \\\"191\\\": 5, \\\"192\\\": 5, \\\"193\\\": 5, \\\"194\\\": 5, \\\"97\\\": 11, \\\"232\\\": 4, \\\"195\\\": 5, \\\"86\\\": 13, \\\"233\\\": 4, \\\"479\\\": 1, \\\"340\\\": 2, \\\"480\\\": 1, \\\"234\\\": 4, \\\"481\\\": 1, \\\"196\\\": 5, \\\"273\\\": 3, \\\"149\\\": 7, \\\"150\\\": 7, \\\"235\\\": 4, \\\"274\\\": 3, \\\"275\\\": 3, \\\"341\\\": 2, \\\"342\\\": 2, \\\"170\\\": 6, \\\"343\\\": 2, \\\"171\\\": 6, \\\"482\\\": 1, \\\"172\\\": 6, \\\"18\\\": 45, \\\"483\\\": 1, \\\"344\\\": 2, \\\"345\\\": 2, \\\"276\\\": 3, \\\"236\\\": 4, \\\"61\\\": 19, \\\"87\\\": 13, \\\"27\\\": 38, \\\"17\\\": 49, \\\"19\\\": 43, \\\"20\\\": 43, \\\"79\\\": 14, \\\"277\\\": 3, \\\"278\\\": 3, \\\"128\\\": 9, \\\"71\\\": 16, \\\"25\\\": 39, \\\"279\\\": 3, \\\"280\\\": 3, \\\"10\\\": 81, \\\"39\\\": 27, \\\"107\\\": 11, \\\"88\\\": 13, \\\"98\\\": 12, \\\"108\\\": 11, \\\"129\\\": 9, \\\"130\\\": 9, \\\"131\\\": 9, \\\"132\\\": 9, \\\"484\\\": 1, \\\"485\\\": 1, \\\"346\\\": 2, \\\"281\\\": 3, \\\"28\\\": 38, \\\"237\\\": 4, \\\"282\\\": 3, \\\"486\\\": 1, \\\"487\\\": 1, \\\"238\\\": 4, \\\"151\\\": 7, \\\"53\\\": 21, \\\"37\\\": 28, \\\"99\\\": 12, \\\"40\\\": 27, \\\"45\\\": 23, \\\"239\\\": 4, \\\"347\\\": 2, \\\"72\\\": 16, \\\"348\\\": 2, \\\"349\\\": 2, \\\"350\\\": 2, \\\"352\\\": 2, \\\"351\\\": 2, \\\"133\\\": 9, \\\"54\\\": 22, \\\"12\\\": 58, \\\"152\\\": 7, \\\"283\\\": 3, \\\"284\\\": 3, \\\"49\\\": 23, \\\"118\\\": 10, \\\"285\\\": 3, \\\"173\\\": 6, \\\"174\\\": 6, \\\"153\\\": 7, \\\"240\\\": 4, \\\"109\\\": 11, \\\"287\\\": 3, \\\"286\\\": 3, \\\"488\\\": 1, \\\"46\\\": 25, \\\"74\\\": 15, \\\"154\\\": 7, \\\"288\\\": 3, \\\"134\\\": 9, \\\"100\\\": 12, \\\"197\\\": 5, \\\"75\\\": 15, \\\"198\\\": 5, \\\"199\\\": 5, \\\"200\\\": 5, \\\"201\\\": 5, \\\"119\\\": 10, \\\"289\\\": 3, \\\"290\\\": 3, \\\"202\\\": 5, \\\"135\\\": 9, \\\"155\\\": 7, \\\"489\\\": 1, \\\"203\\\": 5, \\\"242\\\": 4, \\\"241\\\": 4, \\\"145\\\": 8, \\\"353\\\": 2, \\\"120\\\": 10, \\\"490\\\": 1, \\\"491\\\": 1, \\\"89\\\": 13, \\\"492\\\": 1, \\\"493\\\": 1, \\\"69\\\": 17, \\\"175\\\": 6, \\\"494\\\": 1, \\\"110\\\": 11, \\\"495\\\": 1, \\\"291\\\": 3, \\\"243\\\": 4, \\\"354\\\": 2, \\\"355\\\": 2, \\\"496\\\": 1, \\\"356\\\": 2, \\\"357\\\": 2, \\\"358\\\": 2, \\\"359\\\": 2, \\\"244\\\": 4, \\\"360\\\": 2, \\\"497\\\": 1, \\\"361\\\": 2, \\\"362\\\": 2, \\\"363\\\": 2, \\\"245\\\": 4, \\\"156\\\": 7, \\\"292\\\": 3, \\\"364\\\": 2, \\\"295\\\": 3, \\\"294\\\": 3, \\\"293\\\": 3, \\\"80\\\": 14, \\\"246\\\": 2, \\\"366\\\": 2, \\\"296\\\": 3, \\\"365\\\": 2, \\\"157\\\": 7, \\\"498\\\": 1, \\\"247\\\": 4, \\\"176\\\": 6, \\\"90\\\": 13, \\\"367\\\": 2, \\\"297\\\": 3, \\\"248\\\": 4, \\\"298\\\": 3, \\\"368\\\": 2, \\\"369\\\": 2, \\\"177\\\": 6, \\\"299\\\": 3, \\\"178\\\": 6, \\\"370\\\": 2, \\\"34\\\": 29, \\\"371\\\": 2, \\\"499\\\": 1, \\\"204\\\": 5, \\\"372\\\": 2, \\\"373\\\": 2, \\\"374\\\": 2, \\\"375\\\": 2, \\\"376\\\": 2, \\\"500\\\": 1, \\\"377\\\": 2, \\\"378\\\": 2, \\\"249\\\": 4, \\\"379\\\": 2, \\\"380\\\": 2, \\\"381\\\": 2, \\\"382\\\": 2, \\\"101\\\": 12, \\\"300\\\": 3, \\\"121\\\": 10, \\\"501\\\": 1, \\\"41\\\": 27, \\\"136\\\": 9, \\\"205\\\": 5, \\\"179\\\": 6, \\\"138\\\": 9, \\\"62\\\": 20, \\\"111\\\": 11, \\\"137\\\": 9, \\\"385\\\": 2, \\\"387\\\": 2, \\\"384\\\": 2, \\\"386\\\": 2, \\\"383\\\": 2, \\\"388\\\": 2, \\\"389\\\": 2, \\\"302\\\": 3, \\\"301\\\": 3, \\\"390\\\": 2, \\\"391\\\": 2, \\\"206\\\": 5, \\\"393\\\": 2, \\\"392\\\": 2, \\\"304\\\": 3, \\\"303\\\": 3, \\\"502\\\": 1, \\\"394\\\": 2, \\\"504\\\": 1, \\\"503\\\": 1, \\\"505\\\": 1, \\\"395\\\": 2, \\\"506\\\": 1, \\\"305\\\": 3, \\\"306\\\": 3, \\\"507\\\": 1, \\\"396\\\": 2, \\\"397\\\": 2, \\\"180\\\": 6, \\\"508\\\": 1, \\\"398\\\": 2, \\\"399\\\": 2, \\\"400\\\": 2, \\\"509\\\": 1, \\\"511\\\": 1, \\\"510\\\": 1, \\\"81\\\": 14, \\\"512\\\": 1, \\\"513\\\": 1, \\\"146\\\": 8, \\\"401\\\": 2, \\\"402\\\": 2, \\\"403\\\": 2, \\\"404\\\": 2, \\\"514\\\": 1, \\\"26\\\": 39, \\\"515\\\": 1, \\\"516\\\": 1, \\\"405\\\": 2, \\\"517\\\": 1, \\\"181\\\": 6, \\\"406\\\": 2, \\\"407\\\": 2, \\\"408\\\": 2, \\\"250\\\": 4, \\\"409\\\": 2, \\\"412\\\": 2, \\\"413\\\": 2, \\\"410\\\": 2, \\\"411\\\": 2, \\\"414\\\": 2, \\\"158\\\": 7, \\\"307\\\": 3, \\\"415\\\": 2, \\\"416\\\": 2, \\\"417\\\": 2, \\\"419\\\": 2, \\\"418\\\": 2, \\\"518\\\": 1, \\\"519\\\": 1, \\\"520\\\": 1, \\\"522\\\": 1, \\\"68\\\": 18, \\\"521\\\": 1, \\\"420\\\": 2, \\\"523\\\": 1, \\\"421\\\": 2, \\\"524\\\": 1, \\\"207\\\": 5, \\\"422\\\": 2, \\\"525\\\": 1, \\\"423\\\": 2, \\\"424\\\": 2, \\\"425\\\": 2}\", \"index_word\": \"{\\\"1\\\": \\\"of\\\", \\\"2\\\": \\\"what\\\", \\\"3\\\": \\\"is\\\", \\\"4\\\": \\\"are\\\", \\\"5\\\": \\\"the\\\", \\\"6\\\": \\\"in\\\", \\\"7\\\": \\\"how\\\", \\\"8\\\": \\\"islam\\\", \\\"9\\\": \\\"quran\\\", \\\"10\\\": \\\"condition\\\", \\\"11\\\": \\\"many\\\", \\\"12\\\": \\\"prayer\\\", \\\"13\\\": \\\"to\\\", \\\"14\\\": \\\"there\\\", \\\"15\\\": \\\"do\\\", \\\"16\\\": \\\"you\\\", \\\"17\\\": \\\"pillar\\\", \\\"18\\\": \\\"first\\\", \\\"19\\\": \\\"profession\\\", \\\"20\\\": \\\"faith\\\", \\\"21\\\": \\\"can\\\", \\\"22\\\": \\\"and\\\", \\\"23\\\": \\\"who\\\", \\\"24\\\": \\\"when\\\", \\\"25\\\": \\\"shahadah\\\", \\\"26\\\": \\\"hajj\\\", \\\"27\\\": \\\"importance\\\", \\\"28\\\": \\\"benefits\\\", \\\"29\\\": \\\"why\\\", \\\"30\\\": \\\"for\\\", \\\"31\\\": \\\"ayah\\\", \\\"32\\\": \\\"verses\\\", \\\"33\\\": \\\"numbers\\\", \\\"34\\\": \\\"zakat\\\", \\\"35\\\": \\\"or\\\", \\\"36\\\": \\\"pbuh\\\", \\\"37\\\": \\\"salah\\\", \\\"38\\\": \\\"muhammad\\\", \\\"39\\\": \\\"explain\\\", \\\"40\\\": \\\"namaz\\\", \\\"41\\\": \\\"fasting\\\", \\\"42\\\": \\\"we\\\", \\\"43\\\": \\\"role\\\", \\\"44\\\": \\\"a\\\", \\\"45\\\": \\\"prayers\\\", \\\"46\\\": \\\"eid\\\", \\\"47\\\": \\\"jinns\\\", \\\"48\\\": \\\"ghosts\\\", \\\"49\\\": \\\"wudu\\\", \\\"50\\\": \\\"muslims\\\", \\\"51\\\": \\\"holy\\\", \\\"52\\\": \\\"ayats\\\", \\\"53\\\": \\\"i\\\", \\\"54\\\": \\\"perform\\\", \\\"55\\\": \\\"meaning\\\", \\\"56\\\": \\\"chapters\\\", \\\"57\\\": \\\"types\\\", \\\"58\\\": \\\"makki\\\", \\\"59\\\": \\\"madani\\\", \\\"60\\\": \\\"madinan\\\", \\\"61\\\": \\\"important\\\", \\\"62\\\": \\\"fast\\\", \\\"63\\\": \\\"other\\\", \\\"64\\\": \\\"where\\\", \\\"65\\\": \\\"hazrat\\\", \\\"66\\\": \\\"muslim\\\", \\\"67\\\": \\\"number\\\", \\\"68\\\": \\\"ihram\\\", \\\"69\\\": \\\"during\\\", \\\"70\\\": \\\"meccan\\\", \\\"71\\\": \\\"conditions\\\", \\\"72\\\": \\\"compulsory\\\", \\\"73\\\": \\\"from\\\", \\\"74\\\": \\\"pray\\\", \\\"75\\\": \\\"benefit\\\", \\\"76\\\": \\\"which\\\", \\\"77\\\": \\\"will\\\", \\\"78\\\": \\\"prophets\\\", \\\"79\\\": \\\"parts\\\", \\\"80\\\": \\\"ghusl\\\", \\\"81\\\": \\\"jihad\\\", \\\"82\\\": \\\"allah\\\", \\\"83\\\": \\\"angels\\\", \\\"84\\\": \\\"scriptures\\\", \\\"85\\\": \\\"sajdah\\\", \\\"86\\\": \\\"on\\\", \\\"87\\\": \\\"shahada\\\", \\\"88\\\": \\\"third\\\", \\\"89\\\": \\\"tarawih\\\", \\\"90\\\": \\\"tayammum\\\", \\\"91\\\": \\\"scroll\\\", \\\"92\\\": \\\"books\\\", \\\"93\\\": \\\"difference\\\", \\\"94\\\": \\\"between\\\", \\\"95\\\": \\\"bismillah\\\", \\\"96\\\": \\\"surahs\\\", \\\"97\\\": \\\"day\\\", \\\"98\\\": \\\"fourth\\\", \\\"99\\\": \\\"salat\\\", \\\"100\\\": \\\"women\\\", \\\"101\\\": \\\"roza\\\", \\\"102\\\": \\\"was\\\", \\\"103\\\": \\\"your\\\", \\\"104\\\": \\\"by\\\", \\\"105\\\": \\\"at\\\", \\\"106\\\": \\\"that\\\", \\\"107\\\": \\\"second\\\", \\\"108\\\": \\\"fifth\\\", \\\"109\\\": \\\"if\\\", \\\"110\\\": \\\"while\\\", \\\"111\\\": \\\"invalidate\\\", \\\"112\\\": \\\"should\\\", \\\"113\\\": \\\"names\\\", \\\"114\\\": \\\"angel\\\", \\\"115\\\": \\\"surah\\\", \\\"116\\\": \\\"e\\\", \\\"117\\\": \\\"mecca\\\", \\\"118\\\": \\\"before\\\", \\\"119\\\": \\\"rakats\\\", \\\"120\\\": \\\"tahajjud\\\", \\\"121\\\": \\\"sawm\\\", \\\"122\\\": \\\"time\\\", \\\"123\\\": \\\"made\\\", \\\"124\\\": \\\"trumpet\\\", \\\"125\\\": \\\"times\\\", \\\"126\\\": \\\"soor\\\", \\\"127\\\": \\\"ayat\\\", \\\"128\\\": \\\"have\\\", \\\"129\\\": \\\"sixth\\\", \\\"130\\\": \\\"seventh\\\", \\\"131\\\": \\\"eighth\\\", \\\"132\\\": \\\"ninth\\\", \\\"133\\\": \\\"five\\\", \\\"134\\\": \\\"men\\\", \\\"135\\\": \\\"namazejummah\\\", \\\"136\\\": \\\"excluded\\\", \\\"137\\\": \\\"actions\\\", \\\"138\\\": \\\"nullify\\\", \\\"139\\\": \\\"age\\\", \\\"140\\\": \\\"not\\\", \\\"141\\\": \\\"does\\\", \\\"142\\\": \\\"list\\\", \\\"143\\\": \\\"food\\\", \\\"144\\\": \\\"become\\\", \\\"145\\\": \\\"home\\\", \\\"146\\\": \\\"greater\\\", \\\"147\\\": \\\"meant\\\", \\\"148\\\": \\\"know\\\", \\\"149\\\": \\\"halal\\\", \\\"150\\\": \\\"haram\\\", \\\"151\\\": \\\"take\\\", \\\"152\\\": \\\"stepbystep\\\", \\\"153\\\": \\\"different\\\", \\\"154\\\": \\\"my\\\", \\\"155\\\": \\\"jummah\\\", \\\"156\\\": \\\"break\\\", \\\"157\\\": \\\"acts\\\", \\\"158\\\": \\\"clothing\\\", \\\"159\\\": \\\"me\\\", \\\"160\\\": \\\"listen\\\", \\\"161\\\": \\\"live\\\", \\\"162\\\": \\\"humans\\\", \\\"163\\\": \\\"great\\\", \\\"164\\\": \\\"known\\\", \\\"165\\\": \\\"israfel\\\", \\\"166\\\": \\\"blow\\\", \\\"167\\\": \\\"place\\\", \\\"168\\\": \\\"excluding\\\", \\\"169\\\": \\\"including\\\", \\\"170\\\": \\\"kabah\\\", \\\"171\\\": \\\"one\\\", \\\"172\\\": \\\"qibla\\\", \\\"173\\\": \\\"5\\\", \\\"174\\\": \\\"postures\\\", \\\"175\\\": \\\"praying\\\", \\\"176\\\": \\\"water\\\", \\\"177\\\": \\\"laylat\\\", \\\"178\\\": \\\"alqadr\\\", \\\"179\\\": \\\"excused\\\", \\\"180\\\": \\\"forbidden\\\", \\\"181\\\": \\\"pilgrimage\\\", \\\"182\\\": \\\"see\\\", \\\"183\\\": \\\"name\\\", \\\"184\\\": \\\"like\\\", \\\"185\\\": \\\"with\\\", \\\"186\\\": \\\"eat\\\", \\\"187\\\": \\\"mother\\\", \\\"188\\\": \\\"father\\\", \\\"189\\\": \\\"parents\\\", \\\"190\\\": \\\"imams\\\", \\\"191\\\": \\\"coming\\\", \\\"192\\\": \\\"qayamah\\\", \\\"193\\\": \\\"qiyamat\\\", \\\"194\\\": \\\"judgment\\\", \\\"195\\\": \\\"arrive\\\", \\\"196\\\": \\\"month\\\", \\\"197\\\": \\\"fajar\\\", \\\"198\\\": \\\"zuhar\\\", \\\"199\\\": \\\"asar\\\", \\\"200\\\": \\\"maghrib\\\", \\\"201\\\": \\\"isha\\\", \\\"202\\\": \\\"jumma\\\", \\\"203\\\": \\\"friday\\\", \\\"204\\\": \\\"imprtance\\\", \\\"205\\\": \\\"ramadan\\\", \\\"206\\\": \\\"use\\\", \\\"207\\\": \\\"state\\\", \\\"208\\\": \\\"about\\\", \\\"209\\\": \\\"music\\\", \\\"210\\\": \\\"watch\\\", \\\"211\\\": \\\"wordly\\\", \\\"212\\\": \\\"anyone\\\", \\\"213\\\": \\\"us\\\", \\\"214\\\": \\\"jibril\\\", \\\"215\\\": \\\"azrael\\\", \\\"216\\\": \\\"mikail\\\", \\\"217\\\": \\\"kiraman\\\", \\\"218\\\": \\\"katibin\\\", \\\"219\\\": \\\"muqarrabun\\\", \\\"220\\\": \\\"munkar\\\", \\\"221\\\": \\\"nakir\\\", \\\"222\\\": \\\"archangel\\\", \\\"223\\\": \\\"death\\\", \\\"224\\\": \\\"michael\\\", \\\"225\\\": \\\"real\\\", \\\"226\\\": \\\"powers\\\", \\\"227\\\": \\\"disbelievers\\\", \\\"228\\\": \\\"jesus\\\", \\\"229\\\": \\\"koran\\\", \\\"230\\\": \\\"adoration\\\", \\\"231\\\": \\\"qiyamah\\\", \\\"232\\\": \\\"qayamat\\\", \\\"233\\\": \\\"months\\\", \\\"234\\\": \\\"best\\\", \\\"235\\\": \\\"animals\\\", \\\"236\\\": \\\"purpose\\\", \\\"237\\\": \\\"recite\\\", \\\"238\\\": \\\"without\\\", \\\"239\\\": \\\"obligatory\\\", \\\"240\\\": \\\"miss\\\", \\\"241\\\": \\\"steps\\\", \\\"242\\\": \\\"offer\\\", \\\"243\\\": \\\"dua\\\", \\\"244\\\": \\\"fitrana\\\", \\\"245\\\": \\\"performing\\\", \\\"246\\\": \\\"step\\\", \\\"247\\\": \\\"available\\\", \\\"248\\\": \\\"after\\\", \\\"249\\\": \\\"much\\\", \\\"250\\\": \\\"umrah\\\", \\\"251\\\": \\\"thanks\\\", \\\"252\\\": \\\"busy\\\", \\\"253\\\": \\\"any\\\", \\\"254\\\": \\\"chatbot\\\", \\\"255\\\": \\\"think\\\", \\\"256\\\": \\\"say\\\", \\\"257\\\": \\\"movie\\\", \\\"258\\\": \\\"love\\\", \\\"259\\\": \\\"created\\\", \\\"260\\\": \\\"gabriel\\\", \\\"261\\\": \\\"concept\\\", \\\"262\\\": \\\"places\\\", \\\"263\\\": \\\"last\\\", \\\"264\\\": \\\"died\\\", \\\"265\\\": \\\"pbuhs\\\", \\\"266\\\": \\\"companions\\\", \\\"267\\\": \\\"scrolls\\\", \\\"268\\\": \\\"abraham\\\", \\\"269\\\": \\\"moses\\\", \\\"270\\\": \\\"ibrahim\\\", \\\"271\\\": \\\"musa\\\", \\\"272\\\": \\\"imam\\\", \\\"273\\\": \\\"year\\\", \\\"274\\\": \\\"major\\\", \\\"275\\\": \\\"beliefs\\\", \\\"276\\\": \\\"worship\\\", \\\"277\\\": \\\"2\\\", \\\"278\\\": \\\"consist\\\", \\\"279\\\": \\\"necessary\\\", \\\"280\\\": \\\"being\\\", \\\"281\\\": \\\"reciting\\\", \\\"282\\\": \\\"most\\\", \\\"283\\\": \\\"each\\\", \\\"284\\\": \\\"rakah\\\", \\\"285\\\": \\\"wo\\\", \\\"286\\\": \\\"get\\\", \\\"287\\\": \\\"missed\\\", \\\"288\\\": \\\"area\\\", \\\"289\\\": \\\"than\\\", \\\"290\\\": \\\"daily\\\", \\\"291\\\": \\\"special\\\", \\\"292\\\": \\\"clothes\\\", \\\"293\\\": \\\"wudhu\\\", \\\"294\\\": \\\"over\\\", \\\"295\\\": \\\"socks\\\", \\\"296\\\": \\\"considered\\\", \\\"297\\\": \\\"situations\\\", \\\"298\\\": \\\"making\\\", \\\"299\\\": \\\"rewards\\\", \\\"300\\\": \\\"sayam\\\", \\\"301\\\": \\\"nose\\\", \\\"302\\\": \\\"bleeds\\\", \\\"303\\\": \\\"diabetes\\\", \\\"304\\\": \\\"medical\\\", \\\"305\\\": \\\"brush\\\", \\\"306\\\": \\\"teeth\\\", \\\"307\\\": \\\"rules\\\", \\\"308\\\": \\\"hi\\\", \\\"309\\\": \\\"doing\\\", \\\"310\\\": \\\"bye\\\", \\\"311\\\": \\\"helpful\\\", \\\"312\\\": \\\"introduction\\\", \\\"313\\\": \\\"alsiraj\\\", \\\"314\\\": \\\"now\\\", \\\"315\\\": \\\"whats\\\", \\\"316\\\": \\\"weather\\\", \\\"317\\\": \\\"boss\\\", \\\"318\\\": \\\"musics\\\", \\\"319\\\": \\\"people\\\", \\\"320\\\": \\\"once\\\", \\\"321\\\": \\\"help\\\", \\\"322\\\": \\\"god\\\", \\\"323\\\": \\\"eyes\\\", \\\"324\\\": \\\"look\\\", \\\"325\\\": \\\"type\\\", \\\"326\\\": \\\"dwelling\\\", \\\"327\\\": \\\"believers\\\", \\\"328\\\": \\\"total\\\", \\\"329\\\": \\\"prophet\\\", \\\"330\\\": \\\"sahabah\\\", \\\"331\\\": \\\"sahaba\\\", \\\"332\\\": \\\"words\\\", \\\"333\\\": \\\"gospel\\\", \\\"334\\\": \\\"injil\\\", \\\"335\\\": \\\"zabur\\\", \\\"336\\\": \\\"torah\\\", \\\"337\\\": \\\"tawrat\\\", \\\"338\\\": \\\"proof\\\", \\\"339\\\": \\\"four\\\", \\\"340\\\": \\\"islamic\\\", \\\"341\\\": \\\"study\\\", \\\"342\\\": \\\"seerah\\\", \\\"343\\\": \\\"built\\\", \\\"344\\\": \\\"masjid\\\", \\\"345\\\": \\\"mosque\\\", \\\"346\\\": \\\"life\\\", \\\"347\\\": \\\"fard\\\", \\\"348\\\": \\\"wajib\\\", \\\"349\\\": \\\"sunni\\\", \\\"350\\\": \\\"sunnah\\\", \\\"351\\\": \\\"voluntary\\\", \\\"352\\\": \\\"nafl\\\", \\\"353\\\": \\\"namazejumma\\\", \\\"354\\\": \\\"reward\\\", \\\"355\\\": \\\"perpare\\\", \\\"356\\\": \\\"individually\\\", \\\"357\\\": \\\"timings\\\", \\\"358\\\": \\\"pay\\\", \\\"359\\\": \\\"fitra\\\", \\\"360\\\": \\\"something\\\", \\\"361\\\": \\\"eidulfitr\\\", \\\"362\\\": \\\"eiduladha\\\", \\\"363\\\": \\\"required\\\", \\\"364\\\": \\\"change\\\", \\\"365\\\": \\\"appropriate\\\", \\\"366\\\": \\\"taking\\\", \\\"367\\\": \\\"done\\\", \\\"368\\\": \\\"nullifies\\\", \\\"369\\\": \\\"laylatalqadr\\\", \\\"370\\\": \\\"long\\\", \\\"371\\\": \\\"charity\\\", \\\"372\\\": \\\"principals\\\", \\\"373\\\": \\\"giving\\\", \\\"374\\\": \\\"almal\\\", \\\"375\\\": \\\"alfitr\\\", \\\"376\\\": \\\"distribution\\\", \\\"377\\\": \\\"recipients\\\", \\\"378\\\": \\\"nisab\\\", \\\"379\\\": \\\"gold\\\", \\\"380\\\": \\\"silver\\\", \\\"381\\\": \\\"wealth\\\", \\\"382\\\": \\\"ushr\\\", \\\"383\\\": \\\"tablets\\\", \\\"384\\\": \\\"drops\\\", \\\"385\\\": \\\"injections\\\", \\\"386\\\": \\\"patches\\\", \\\"387\\\": \\\"whilst\\\", \\\"388\\\": \\\"having\\\", \\\"389\\\": \\\"dialysis\\\", \\\"390\\\": \\\"mouthwash\\\", \\\"391\\\": \\\"gargles\\\", \\\"392\\\": \\\"creams\\\", \\\"393\\\": \\\"ointments\\\", \\\"394\\\": \\\"inhaler\\\", \\\"395\\\": \\\"smoke\\\", \\\"396\\\": \\\"bath\\\", \\\"397\\\": \\\"days\\\", \\\"398\\\": \\\"reasons\\\", \\\"399\\\": \\\"suhur\\\", \\\"400\\\": \\\"iftar\\\", \\\"401\\\": \\\"teaches\\\", \\\"402\\\": \\\"learn\\\", \\\"403\\\": \\\"expects\\\", \\\"404\\\": \\\"lesser\\\", \\\"405\\\": \\\"his\\\", \\\"406\\\": \\\"essentail\\\", \\\"407\\\": \\\"whom\\\", \\\"408\\\": \\\"rituals\\\", \\\"409\\\": \\\"duration\\\", \\\"410\\\": \\\"occur\\\", \\\"411\\\": \\\"same\\\", \\\"412\\\": \\\"dates\\\", \\\"413\\\": \\\"every\\\", \\\"414\\\": \\\"did\\\", \\\"415\\\": \\\"woman\\\", \\\"416\\\": \\\"alone\\\", \\\"417\\\": \\\"limit\\\", \\\"418\\\": \\\"cover\\\", \\\"419\\\": \\\"face\\\", \\\"420\\\": \\\"wear\\\", \\\"421\\\": \\\"sleep\\\", \\\"422\\\": \\\"permitted\\\", \\\"423\\\": \\\"act\\\", \\\"424\\\": \\\"restrictions\\\", \\\"425\\\": \\\"lifted\\\", \\\"426\\\": \\\"hey\\\", \\\"427\\\": \\\"hola\\\", \\\"428\\\": \\\"hello\\\", \\\"429\\\": \\\"wassup\\\", \\\"430\\\": \\\"aslam\\\", \\\"431\\\": \\\"u\\\", \\\"432\\\": \\\"alikum\\\", \\\"433\\\": \\\"aoa\\\", \\\"434\\\": \\\"later\\\", \\\"435\\\": \\\"goodbye\\\", \\\"436\\\": \\\"nice\\\", \\\"437\\\": \\\"chatting\\\", \\\"438\\\": \\\"till\\\", \\\"439\\\": \\\"next\\\", \\\"440\\\": \\\"hafiz\\\", \\\"441\\\": \\\"thank\\\", \\\"442\\\": \\\"thats\\\", \\\"443\\\": \\\"awesome\\\", \\\"444\\\": \\\"helping\\\", \\\"445\\\": \\\"chatbots\\\", \\\"446\\\": \\\"anything\\\", \\\"447\\\": \\\"movies\\\", \\\"448\\\": \\\"languages\\\", \\\"449\\\": \\\"speak\\\", \\\"450\\\": \\\"talk\\\", \\\"451\\\": \\\"good\\\", \\\"452\\\": \\\"could\\\", \\\"453\\\": \\\"provide\\\", \\\"454\\\": \\\"be\\\", \\\"455\\\": \\\"support\\\", \\\"456\\\": \\\"offered\\\", \\\"457\\\": \\\"choose\\\", \\\"458\\\": \\\"follow\\\", \\\"459\\\": \\\"gods\\\", \\\"460\\\": \\\"cant\\\", \\\"461\\\": \\\"up\\\", \\\"462\\\": \\\"roles\\\", \\\"463\\\": \\\"gabriell\\\", \\\"464\\\": \\\"says\\\", \\\"465\\\": \\\"born\\\", \\\"466\\\": \\\"birth\\\", \\\"467\\\": \\\"he\\\", \\\"468\\\": \\\"mom\\\", \\\"469\\\": \\\"dad\\\", \\\"470\\\": \\\"were\\\", \\\"471\\\": \\\"means\\\", \\\"472\\\": \\\"unchanged\\\", \\\"473\\\": \\\"corrupted\\\", \\\"474\\\": \\\"oldest\\\", \\\"475\\\": \\\"fragments\\\", \\\"476\\\": \\\"ayatesajdah\\\", \\\"477\\\": \\\"ayahesajdah\\\", \\\"478\\\": \\\"sajdad\\\", \\\"479\\\": \\\"calendar\\\", \\\"480\\\": \\\"dest\\\", \\\"481\\\": \\\"week\\\", \\\"482\\\": \\\"location\\\", \\\"483\\\": \\\"current\\\", \\\"484\\\": \\\"often\\\", \\\"485\\\": \\\"our\\\", \\\"486\\\": \\\"makes\\\", \\\"487\\\": \\\"cannot\\\", \\\"488\\\": \\\"namz\\\", \\\"489\\\": \\\"so\\\", \\\"490\\\": \\\"prepare\\\", \\\"491\\\": \\\"preparations\\\", \\\"492\\\": \\\"rakat\\\", \\\"493\\\": \\\"whole\\\", \\\"494\\\": \\\"hold\\\", \\\"495\\\": \\\"lead\\\", \\\"496\\\": \\\"missing\\\", \\\"497\\\": \\\"eating\\\", \\\"498\\\": \\\"inappropriate\\\", \\\"499\\\": \\\"vs\\\", \\\"500\\\": \\\"distribute\\\", \\\"501\\\": \\\"mportance\\\", \\\"502\\\": \\\"an\\\", \\\"503\\\": \\\"swimming\\\", \\\"504\\\": \\\"breaks\\\", \\\"505\\\": \\\"swiming\\\", \\\"506\\\": \\\"smoking\\\", \\\"507\\\": \\\"kids\\\", \\\"508\\\": \\\"4\\\", \\\"509\\\": \\\"festival\\\", \\\"510\\\": \\\"celebrates\\\", \\\"511\\\": \\\"completion\\\", \\\"512\\\": \\\"actual\\\", \\\"513\\\": \\\"two\\\", \\\"514\\\": \\\"gum\\\", \\\"515\\\": \\\"mean\\\", \\\"516\\\": \\\"word\\\", \\\"517\\\": \\\"enough\\\", \\\"518\\\": \\\"non\\\", \\\"519\\\": \\\"go\\\", \\\"520\\\": \\\"person\\\", \\\"521\\\": \\\"likelihood\\\", \\\"522\\\": \\\"bleeding\\\", \\\"523\\\": \\\"men\\\\u2019s\\\", \\\"524\\\": \\\"these\\\", \\\"525\\\": \\\"youve\\\"}\", \"word_index\": \"{\\\"of\\\": 1, \\\"what\\\": 2, \\\"is\\\": 3, \\\"are\\\": 4, \\\"the\\\": 5, \\\"in\\\": 6, \\\"how\\\": 7, \\\"islam\\\": 8, \\\"quran\\\": 9, \\\"condition\\\": 10, \\\"many\\\": 11, \\\"prayer\\\": 12, \\\"to\\\": 13, \\\"there\\\": 14, \\\"do\\\": 15, \\\"you\\\": 16, \\\"pillar\\\": 17, \\\"first\\\": 18, \\\"profession\\\": 19, \\\"faith\\\": 20, \\\"can\\\": 21, \\\"and\\\": 22, \\\"who\\\": 23, \\\"when\\\": 24, \\\"shahadah\\\": 25, \\\"hajj\\\": 26, \\\"importance\\\": 27, \\\"benefits\\\": 28, \\\"why\\\": 29, \\\"for\\\": 30, \\\"ayah\\\": 31, \\\"verses\\\": 32, \\\"numbers\\\": 33, \\\"zakat\\\": 34, \\\"or\\\": 35, \\\"pbuh\\\": 36, \\\"salah\\\": 37, \\\"muhammad\\\": 38, \\\"explain\\\": 39, \\\"namaz\\\": 40, \\\"fasting\\\": 41, \\\"we\\\": 42, \\\"role\\\": 43, \\\"a\\\": 44, \\\"prayers\\\": 45, \\\"eid\\\": 46, \\\"jinns\\\": 47, \\\"ghosts\\\": 48, \\\"wudu\\\": 49, \\\"muslims\\\": 50, \\\"holy\\\": 51, \\\"ayats\\\": 52, \\\"i\\\": 53, \\\"perform\\\": 54, \\\"meaning\\\": 55, \\\"chapters\\\": 56, \\\"types\\\": 57, \\\"makki\\\": 58, \\\"madani\\\": 59, \\\"madinan\\\": 60, \\\"important\\\": 61, \\\"fast\\\": 62, \\\"other\\\": 63, \\\"where\\\": 64, \\\"hazrat\\\": 65, \\\"muslim\\\": 66, \\\"number\\\": 67, \\\"ihram\\\": 68, \\\"during\\\": 69, \\\"meccan\\\": 70, \\\"conditions\\\": 71, \\\"compulsory\\\": 72, \\\"from\\\": 73, \\\"pray\\\": 74, \\\"benefit\\\": 75, \\\"which\\\": 76, \\\"will\\\": 77, \\\"prophets\\\": 78, \\\"parts\\\": 79, \\\"ghusl\\\": 80, \\\"jihad\\\": 81, \\\"allah\\\": 82, \\\"angels\\\": 83, \\\"scriptures\\\": 84, \\\"sajdah\\\": 85, \\\"on\\\": 86, \\\"shahada\\\": 87, \\\"third\\\": 88, \\\"tarawih\\\": 89, \\\"tayammum\\\": 90, \\\"scroll\\\": 91, \\\"books\\\": 92, \\\"difference\\\": 93, \\\"between\\\": 94, \\\"bismillah\\\": 95, \\\"surahs\\\": 96, \\\"day\\\": 97, \\\"fourth\\\": 98, \\\"salat\\\": 99, \\\"women\\\": 100, \\\"roza\\\": 101, \\\"was\\\": 102, \\\"your\\\": 103, \\\"by\\\": 104, \\\"at\\\": 105, \\\"that\\\": 106, \\\"second\\\": 107, \\\"fifth\\\": 108, \\\"if\\\": 109, \\\"while\\\": 110, \\\"invalidate\\\": 111, \\\"should\\\": 112, \\\"names\\\": 113, \\\"angel\\\": 114, \\\"surah\\\": 115, \\\"e\\\": 116, \\\"mecca\\\": 117, \\\"before\\\": 118, \\\"rakats\\\": 119, \\\"tahajjud\\\": 120, \\\"sawm\\\": 121, \\\"time\\\": 122, \\\"made\\\": 123, \\\"trumpet\\\": 124, \\\"times\\\": 125, \\\"soor\\\": 126, \\\"ayat\\\": 127, \\\"have\\\": 128, \\\"sixth\\\": 129, \\\"seventh\\\": 130, \\\"eighth\\\": 131, \\\"ninth\\\": 132, \\\"five\\\": 133, \\\"men\\\": 134, \\\"namazejummah\\\": 135, \\\"excluded\\\": 136, \\\"actions\\\": 137, \\\"nullify\\\": 138, \\\"age\\\": 139, \\\"not\\\": 140, \\\"does\\\": 141, \\\"list\\\": 142, \\\"food\\\": 143, \\\"become\\\": 144, \\\"home\\\": 145, \\\"greater\\\": 146, \\\"meant\\\": 147, \\\"know\\\": 148, \\\"halal\\\": 149, \\\"haram\\\": 150, \\\"take\\\": 151, \\\"stepbystep\\\": 152, \\\"different\\\": 153, \\\"my\\\": 154, \\\"jummah\\\": 155, \\\"break\\\": 156, \\\"acts\\\": 157, \\\"clothing\\\": 158, \\\"me\\\": 159, \\\"listen\\\": 160, \\\"live\\\": 161, \\\"humans\\\": 162, \\\"great\\\": 163, \\\"known\\\": 164, \\\"israfel\\\": 165, \\\"blow\\\": 166, \\\"place\\\": 167, \\\"excluding\\\": 168, \\\"including\\\": 169, \\\"kabah\\\": 170, \\\"one\\\": 171, \\\"qibla\\\": 172, \\\"5\\\": 173, \\\"postures\\\": 174, \\\"praying\\\": 175, \\\"water\\\": 176, \\\"laylat\\\": 177, \\\"alqadr\\\": 178, \\\"excused\\\": 179, \\\"forbidden\\\": 180, \\\"pilgrimage\\\": 181, \\\"see\\\": 182, \\\"name\\\": 183, \\\"like\\\": 184, \\\"with\\\": 185, \\\"eat\\\": 186, \\\"mother\\\": 187, \\\"father\\\": 188, \\\"parents\\\": 189, \\\"imams\\\": 190, \\\"coming\\\": 191, \\\"qayamah\\\": 192, \\\"qiyamat\\\": 193, \\\"judgment\\\": 194, \\\"arrive\\\": 195, \\\"month\\\": 196, \\\"fajar\\\": 197, \\\"zuhar\\\": 198, \\\"asar\\\": 199, \\\"maghrib\\\": 200, \\\"isha\\\": 201, \\\"jumma\\\": 202, \\\"friday\\\": 203, \\\"imprtance\\\": 204, \\\"ramadan\\\": 205, \\\"use\\\": 206, \\\"state\\\": 207, \\\"about\\\": 208, \\\"music\\\": 209, \\\"watch\\\": 210, \\\"wordly\\\": 211, \\\"anyone\\\": 212, \\\"us\\\": 213, \\\"jibril\\\": 214, \\\"azrael\\\": 215, \\\"mikail\\\": 216, \\\"kiraman\\\": 217, \\\"katibin\\\": 218, \\\"muqarrabun\\\": 219, \\\"munkar\\\": 220, \\\"nakir\\\": 221, \\\"archangel\\\": 222, \\\"death\\\": 223, \\\"michael\\\": 224, \\\"real\\\": 225, \\\"powers\\\": 226, \\\"disbelievers\\\": 227, \\\"jesus\\\": 228, \\\"koran\\\": 229, \\\"adoration\\\": 230, \\\"qiyamah\\\": 231, \\\"qayamat\\\": 232, \\\"months\\\": 233, \\\"best\\\": 234, \\\"animals\\\": 235, \\\"purpose\\\": 236, \\\"recite\\\": 237, \\\"without\\\": 238, \\\"obligatory\\\": 239, \\\"miss\\\": 240, \\\"steps\\\": 241, \\\"offer\\\": 242, \\\"dua\\\": 243, \\\"fitrana\\\": 244, \\\"performing\\\": 245, \\\"step\\\": 246, \\\"available\\\": 247, \\\"after\\\": 248, \\\"much\\\": 249, \\\"umrah\\\": 250, \\\"thanks\\\": 251, \\\"busy\\\": 252, \\\"any\\\": 253, \\\"chatbot\\\": 254, \\\"think\\\": 255, \\\"say\\\": 256, \\\"movie\\\": 257, \\\"love\\\": 258, \\\"created\\\": 259, \\\"gabriel\\\": 260, \\\"concept\\\": 261, \\\"places\\\": 262, \\\"last\\\": 263, \\\"died\\\": 264, \\\"pbuhs\\\": 265, \\\"companions\\\": 266, \\\"scrolls\\\": 267, \\\"abraham\\\": 268, \\\"moses\\\": 269, \\\"ibrahim\\\": 270, \\\"musa\\\": 271, \\\"imam\\\": 272, \\\"year\\\": 273, \\\"major\\\": 274, \\\"beliefs\\\": 275, \\\"worship\\\": 276, \\\"2\\\": 277, \\\"consist\\\": 278, \\\"necessary\\\": 279, \\\"being\\\": 280, \\\"reciting\\\": 281, \\\"most\\\": 282, \\\"each\\\": 283, \\\"rakah\\\": 284, \\\"wo\\\": 285, \\\"get\\\": 286, \\\"missed\\\": 287, \\\"area\\\": 288, \\\"than\\\": 289, \\\"daily\\\": 290, \\\"special\\\": 291, \\\"clothes\\\": 292, \\\"wudhu\\\": 293, \\\"over\\\": 294, \\\"socks\\\": 295, \\\"considered\\\": 296, \\\"situations\\\": 297, \\\"making\\\": 298, \\\"rewards\\\": 299, \\\"sayam\\\": 300, \\\"nose\\\": 301, \\\"bleeds\\\": 302, \\\"diabetes\\\": 303, \\\"medical\\\": 304, \\\"brush\\\": 305, \\\"teeth\\\": 306, \\\"rules\\\": 307, \\\"hi\\\": 308, \\\"doing\\\": 309, \\\"bye\\\": 310, \\\"helpful\\\": 311, \\\"introduction\\\": 312, \\\"alsiraj\\\": 313, \\\"now\\\": 314, \\\"whats\\\": 315, \\\"weather\\\": 316, \\\"boss\\\": 317, \\\"musics\\\": 318, 