"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 4000, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 1833, \"word_counts\": \"{\\\"hi\\\": 6, \\\"there\\\": 62, \\\"hey\\\": 5, \\\"hello\\\": 6, \\\"how\\\": 211, \\\"are\\\": 300, \\\"you\\\": 169, \\\"feeling\\\": 10, \\\"doing\\\": 13, \\\"today\\\": 16, \\\"can\\\": 97, \\\"i\\\": 62, \\\"help\\\": 7, \\\"have\\\": 71, \\\"been\\\": 9, \\\"good\\\": 14, \\\"to\\\": 134, \\\"see\\\": 6, \\\"hallo\\\": 1, \\\"halo\\\": 1, \\\"hola\\\": 1, \\\"wassup\\\": 1, \\\"whats\\\": 9, \\\"up\\\": 3, \\\"sup\\\": 1, \\\"yo\\\": 1, \\\"howdy\\\": 2, \\\"assalamualaikum\\\": 2, \\\"assalamu\\\": 1, \\\"alaikum\\\": 5, \\\"assalam\\\": 1, \\\"u\\\": 4, \\\"asalamualikum\\\": 2, \\\"asalamu\\\": 2, \\\"alikum\\\": 4, \\\"asalam\\\": 3, \\\"aslamualikum\\\": 2, \\\"aslamu\\\": 1, \\\"aslam\\\": 1, \\\"asalamualaikum\\\": 2, \\\"peace\\\": 2, \\\"be\\\": 12, \\\"upon\\\": 2, \\\"and\\\": 70, \\\"wa\\\": 1, \\\"fine\\\": 13, \\\"great\\\": 23, \\\"fantastic\\\": 5, \\\"well\\\": 10, \\\"im\\\": 17, \\\"am\\\": 18, \\\"cant\\\": 2, \\\"complain\\\": 1, \\\"my\\\": 37, \\\"day\\\": 61, \\\"was\\\": 35, \\\"is\\\": 358, \\\"going\\\": 13, \\\"yours\\\": 21, \\\"what\\\": 496, \\\"about\\\": 80, \\\"hows\\\": 1, \\\"everything\\\": 1, \\\"its\\\": 4, \\\"just\\\": 1, \\\"one\\\": 15, \\\"of\\\": 614, \\\"those\\\": 1, \\\"days\\\": 4, \\\"overwhelmed\\\": 3, \\\"not\\\": 18, \\\"a\\\": 98, \\\"rough\\\": 4, \\\"so\\\": 5, \\\"far\\\": 1, \\\"struggling\\\": 3, \\\"bit\\\": 5, \\\"down\\\": 3, \\\"it\\\": 20, \\\"could\\\": 3, \\\"better\\\": 4, \\\"having\\\": 6, \\\"tough\\\": 2, \\\"hasnt\\\": 1, \\\"quite\\\": 1, \\\"bad\\\": 3, \\\"pretty\\\": 2, \\\"meh\\\": 1, \\\"trying\\\": 2, \\\"hang\\\": 1, \\\"in\\\": 236, \\\"honest\\\": 2, \\\"hanging\\\": 1, \\\"thanks\\\": 5, \\\"for\\\": 49, \\\"asking\\\": 1, \\\"ive\\\": 1, \\\"had\\\": 48, \\\"but\\\": 4, \\\"getting\\\": 1, \\\"through\\\": 1, \\\"stay\\\": 1, \\\"positive\\\": 1, \\\"struggle\\\": 1, \\\"right\\\": 8, \\\"now\\\": 9, \\\"hoping\\\": 1, \\\"tomorrow\\\": 1, \\\"will\\\": 15, \\\"really\\\": 1, \\\"myself\\\": 1, \\\"time\\\": 15, \\\"best\\\": 6, \\\"cope\\\": 1, \\\"farewell\\\": 1, \\\"until\\\": 1, \\\"next\\\": 2, \\\"bye\\\": 2, \\\"later\\\": 1, \\\"goodbye\\\": 1, \\\"nice\\\": 1, \\\"chatting\\\": 1, \\\"till\\\": 1, \\\"allah\\\": 13, \\\"hafiz\\\": 2, \\\"khuda\\\": 1, \\\"grateful\\\": 1, \\\"thank\\\": 2, \\\"much\\\": 5, \\\"appreciate\\\": 1, \\\"many\\\": 118, \\\"thats\\\": 1, \\\"helpful\\\": 2, \\\"awesome\\\": 1, \\\"helping\\\": 1, \\\"me\\\": 48, \\\"tell\\\": 27, \\\"joke\\\": 3, \\\"give\\\": 3, \\\"do\\\": 104, \\\"know\\\": 20, \\\"any\\\": 29, \\\"jokes\\\": 2, \\\"need\\\": 2, \\\"make\\\": 2, \\\"laugh\\\": 1, \\\"why\\\": 61, \\\"did\\\": 61, \\\"the\\\": 337, \\\"scarecrow\\\": 1, \\\"win\\\": 1, \\\"an\\\": 3, \\\"award\\\": 1, \\\"call\\\": 2, \\\"fish\\\": 1, \\\"with\\\": 33, \\\"no\\\": 1, \\\"eyes\\\": 3, \\\"dont\\\": 5, \\\"skeletons\\\": 2, \\\"fight\\\": 2, \\\"each\\\": 8, \\\"other\\\": 28, \\\"math\\\": 1, \\\"book\\\": 1, \\\"sad\\\": 1, \\\"catch\\\": 1, \\\"squirrel\\\": 1, \\\"pirates\\\": 1, \\\"favorite\\\": 1, \\\"letter\\\": 1, \\\"tomato\\\": 1, \\\"turn\\\": 1, \\\"red\\\": 1, \\\"wall\\\": 4, \\\"say\\\": 20, \\\"bicycle\\\": 1, \\\"fall\\\": 1, \\\"over\\\": 4, \\\"zero\\\": 1, \\\"eight\\\": 1, \\\"scientists\\\": 1, \\\"trust\\\": 1, \\\"atoms\\\": 1, \\\"tissue\\\": 1, \\\"dance\\\": 1, \\\"eggs\\\": 1, \\\"snowman\\\": 2, \\\"sixpack\\\": 1, \\\"get\\\": 4, \\\"if\\\": 13, \\\"cross\\\": 1, \\\"vampire\\\": 1, \\\"golfer\\\": 1, \\\"bring\\\": 1, \\\"two\\\": 2, \\\"pairs\\\": 1, \\\"pants\\\": 1, \\\"cookie\\\": 1, \\\"go\\\": 2, \\\"doctor\\\": 1, \\\"does\\\": 37, \\\"train\\\": 1, \\\"eat\\\": 6, \\\"story\\\": 21, \\\"share\\\": 5, \\\"want\\\": 8, \\\"hear\\\": 7, \\\"bedtime\\\": 2, \\\"stories\\\": 8, \\\"sleep\\\": 3, \\\"fairy\\\": 3, \\\"tale\\\": 2, \\\"love\\\": 5, \\\"tales\\\": 1, \\\"magical\\\": 3, \\\"animals\\\": 6, \\\"animal\\\": 1, \\\"friendship\\\": 1, \\\"friends\\\": 2, \\\"bravery\\\": 1, \\\"hero\\\": 1, \\\"courage\\\": 1, \\\"magic\\\": 2, \\\"nature\\\": 1, \\\"outdoors\\\": 1, \\\"set\\\": 1, \\\"forest\\\": 1, \\\"outer\\\": 1, \\\"space\\\": 1, \\\"astronauts\\\": 1, \\\"planets\\\": 1, \\\"kingdom\\\": 1, \\\"princesses\\\": 1, \\\"castles\\\": 1, \\\"land\\\": 1, \\\"your\\\": 26, \\\"occupation\\\": 1, \\\"who\\\": 47, \\\"introduction\\\": 2, \\\"purpose\\\": 6, \\\"capabilities\\\": 2, \\\"kind\\\": 3, \\\"assistance\\\": 1, \\\"provide\\\": 4, \\\"like\\\": 7, \\\"called\\\": 1, \\\"name\\\": 12, \\\"title\\\": 1, \\\"use\\\": 13, \\\"should\\\": 15, \\\"refer\\\": 1, \\\"alsiraj\\\": 5, \\\"signify\\\": 1, \\\"islam\\\": 214, \\\"exactly\\\": 1, \\\"meant\\\": 8, \\\"by\\\": 15, \\\"age\\\": 9, \\\"old\\\": 2, \\\"where\\\": 26, \\\"live\\\": 6, \\\"from\\\": 20, \\\"married\\\": 5, \\\"spouse\\\": 1, \\\"wife\\\": 1, \\\"husband\\\": 1, \\\"children\\\": 23, \\\"languages\\\": 8, \\\"speak\\\": 4, \\\"which\\\": 24, \\\"only\\\": 2, \\\"english\\\": 6, \\\"than\\\": 7, \\\"able\\\": 4, \\\"understand\\\": 2, \\\"respond\\\": 3, \\\"urdu\\\": 3, \\\"goal\\\": 2, \\\"goals\\\": 1, \\\"aim\\\": 2, \\\"aims\\\": 1, \\\"mission\\\": 3, \\\"busy\\\": 5, \\\"talk\\\": 2, \\\"free\\\": 6, \\\"moment\\\": 2, \\\"chat\\\": 2, \\\"currently\\\": 1, \\\"assist\\\": 1, \\\"ask\\\": 1, \\\"question\\\": 1, \\\"spare\\\": 1, \\\"some\\\": 18, \\\"at\\\": 12, \\\"chatbots\\\": 1, \\\"chatbot\\\": 3, \\\"think\\\": 3, \\\"thoughts\\\": 2, \\\"or\\\": 32, \\\"opinions\\\": 1, \\\"on\\\": 32, \\\"opinion\\\": 1, \\\"anything\\\": 1, \\\"something\\\": 5, \\\"weather\\\": 2, \\\"week\\\": 3, \\\"this\\\": 1, \\\"date\\\": 5, \\\"recognize\\\": 2, \\\"guess\\\": 1, \\\"still\\\": 2, \\\"remember\\\": 9, \\\"we\\\": 41, \\\"talked\\\": 5, \\\"recall\\\": 11, \\\"our\\\": 3, \\\"conversation\\\": 2, \\\"discussed\\\": 1, \\\"yesturday\\\": 3, \\\"before\\\": 15, \\\"chatted\\\": 3, \\\"interacted\\\": 1, \\\"previous\\\": 11, \\\"conversations\\\": 3, \\\"information\\\": 7, \\\"interactions\\\": 1, \\\"store\\\": 3, \\\"all\\\": 3, \\\"asked\\\": 3, \\\"save\\\": 2, \\\"keep\\\": 2, \\\"history\\\": 4, \\\"data\\\": 2, \\\"interaction\\\": 1, \\\"people\\\": 3, \\\"once\\\": 2, \\\"humans\\\": 6, \\\"support\\\": 1, \\\"offered\\\": 1, \\\"choose\\\": 2, \\\"follow\\\": 1, \\\"wordly\\\": 4, \\\"meaning\\\": 23, \\\"fact\\\": 4, \\\"facts\\\": 1, \\\"interesting\\\": 1, \\\"learn\\\": 3, \\\"may\\\": 1, \\\"god\\\": 2, \\\"gods\\\": 1, \\\"names\\\": 35, \\\"anyone\\\": 4, \\\"when\\\": 48, \\\"look\\\": 2, \\\"us\\\": 5, \\\"angels\\\": 13, \\\"created\\\": 3, \\\"made\\\": 9, \\\"roles\\\": 1, \\\"numbers\\\": 29, \\\"known\\\": 6, \\\"jibril\\\": 4, \\\"role\\\": 27, \\\"israfel\\\": 6, \\\"blow\\\": 6, \\\"trumpet\\\": 9, \\\"times\\\": 13, \\\"soor\\\": 9, \\\"azrael\\\": 4, \\\"mikail\\\": 4, \\\"kiraman\\\": 4, \\\"katibin\\\": 4, \\\"muqarrabun\\\": 4, \\\"munkar\\\": 4, \\\"nakir\\\": 4, \\\"archangel\\\": 4, \\\"gabriel\\\": 3, \\\"gabriell\\\": 1, \\\"angel\\\": 10, \\\"death\\\": 4, \\\"michael\\\": 4, \\\"jinns\\\": 24, \\\"concept\\\": 5, \\\"real\\\": 4, \\\"powers\\\": 4, \\\"types\\\": 20, \\\"list\\\": 22, \\\"type\\\": 2, \\\"food\\\": 8, \\\"dwelling\\\": 2, \\\"places\\\": 3, \\\"muslims\\\": 63, \\\"disbelievers\\\": 4, \\\"believers\\\": 2, \\\"ghosts\\\": 24, \\\"prophets\\\": 14, \\\"total\\\": 2, \\\"quran\\\": 98, \\\"jesus\\\": 4, \\\"says\\\": 4, \\\"last\\\": 3, \\\"prophet\\\": 35, \\\"muhammad\\\": 170, \\\"pbuh\\\": 107, \\\"term\\\": 1, \\\"means\\\": 2, \\\"stands\\\": 1, \\\"hazrat\\\": 54, \\\"muhammads\\\": 6, \\\"using\\\": 3, \\\"matter\\\": 1, \\\"necessary\\\": 5, \\\"essential\\\": 2, \\\"important\\\": 24, \\\"compulsory\\\": 18, \\\"born\\\": 2, \\\"birth\\\": 2, \\\"place\\\": 10, \\\"died\\\": 10, \\\"he\\\": 2, \\\"mother\\\": 10, \\\"mom\\\": 2, \\\"pbuhs\\\": 5, \\\"father\\\": 16, \\\"dad\\\": 4, \\\"were\\\": 2, \\\"parents\\\": 10, \\\"ever\\\": 8, \\\"wives\\\": 28, \\\"has\\\": 6, \\\"number\\\": 31, \\\"his\\\": 14, \\\"kids\\\": 21, \\\"daughters\\\": 26, \\\"sons\\\": 26, \\\"companions\\\": 6, \\\"sahabah\\\": 2, \\\"sahaba\\\": 2, \\\"muslim\\\": 24, \\\"become\\\": 8, \\\"words\\\": 2, \\\"holy\\\": 22, \\\"scrolls\\\": 3, \\\"scroll\\\": 12, \\\"abraham\\\": 3, \\\"moses\\\": 3, \\\"ibrahim\\\": 3, \\\"musa\\\": 3, \\\"books\\\": 12, \\\"scriptures\\\": 13, \\\"gospel\\\": 2, \\\"injil\\\": 2, \\\"zabur\\\": 2, \\\"torah\\\": 2, \\\"tawrat\\\": 2, \\\"koran\\\": 4, \\\"difference\\\": 12, \\\"between\\\": 12, \\\"proof\\\": 2, \\\"that\\\": 13, \\\"unchanged\\\": 1, \\\"corrupted\\\": 1, \\\"oldest\\\": 1, \\\"fragments\\\": 1, \\\"chapters\\\": 21, \\\"surah\\\": 10, \\\"verses\\\": 30, \\\"ayah\\\": 31, \\\"ayat\\\": 9, \\\"excluding\\\": 6, \\\"bismillah\\\": 12, \\\"including\\\": 6, \\\"ayats\\\": 22, \\\"sajdah\\\": 13, \\\"e\\\": 10, \\\"ayatesajdah\\\": 1, \\\"ayahesajdah\\\": 1, \\\"adoration\\\": 4, \\\"sajdad\\\": 1, \\\"makki\\\": 20, \\\"surahs\\\": 12, \\\"mecca\\\": 15, \\\"meccan\\\": 16, \\\"madani\\\": 20, \\\"madinan\\\": 20, \\\"imam\\\": 3, \\\"imams\\\": 5, \\\"four\\\": 2, \\\"qiyamah\\\": 4, \\\"coming\\\": 5, \\\"qayamah\\\": 5, \\\"qiyamat\\\": 5, \\\"judgment\\\": 5, \\\"qayamat\\\": 4, \\\"arrive\\\": 5, \\\"months\\\": 4, \\\"calendar\\\": 6, \\\"islamic\\\": 33, \\\"dest\\\": 1, \\\"month\\\": 6, \\\"year\\\": 3, \\\"halal\\\": 9, \\\"haram\\\": 12, \\\"major\\\": 8, \\\"beliefs\\\": 3, \\\"study\\\": 2, \\\"seerah\\\": 2, \\\"kabah\\\": 6, \\\"built\\\": 2, \\\"location\\\": 2, \\\"qibla\\\": 6, \\\"first\\\": 48, \\\"current\\\": 1, \\\"masjid\\\": 2, \\\"mosque\\\": 2, \\\"worship\\\": 3, \\\"shahada\\\": 13, \\\"importance\\\": 40, \\\"pillar\\\": 49, \\\"profession\\\": 45, \\\"faith\\\": 47, \\\"parts\\\": 14, \\\"2\\\": 3, \\\"consist\\\": 3, \\\"conditions\\\": 16, \\\"shahadah\\\": 39, \\\"being\\\": 5, \\\"condition\\\": 81, \\\"explain\\\": 31, \\\"second\\\": 11, \\\"third\\\": 13, \\\"fourth\\\": 12, \\\"fifth\\\": 11, \\\"sixth\\\": 9, \\\"seventh\\\": 9, \\\"eighth\\\": 9, \\\"ninth\\\": 9, \\\"often\\\": 1, \\\"life\\\": 2, \\\"benefits\\\": 38, \\\"reciting\\\": 3, \\\"recite\\\": 4, \\\"most\\\": 6, \\\"makes\\\": 3, \\\"cannot\\\": 1, \\\"without\\\": 4, \\\"take\\\": 7, \\\"salah\\\": 28, \\\"salat\\\": 12, \\\"namaz\\\": 27, \\\"prayers\\\": 28, \\\"obligatory\\\": 5, \\\"fard\\\": 2, \\\"wajib\\\": 2, \\\"sunni\\\": 2, \\\"sunnah\\\": 2, \\\"voluntary\\\": 2, \\\"nafl\\\": 2, \\\"five\\\": 13, \\\"perform\\\": 22, \\\"prayer\\\": 63, \\\"stepbystep\\\": 7, \\\"rakah\\\": 3, \\\"wudu\\\": 23, \\\"wo\\\": 3, \\\"5\\\": 6, \\\"different\\\": 9, \\\"postures\\\": 6, \\\"miss\\\": 5, \\\"missed\\\": 3, \\\"namz\\\": 1, \\\"pray\\\": 17, \\\"eid\\\": 30, \\\"area\\\": 3, \\\"men\\\": 9, \\\"women\\\": 17, \\\"benefit\\\": 15, \\\"fajar\\\": 5, \\\"zuhar\\\": 5, \\\"asar\\\": 5, \\\"maghrib\\\": 5, \\\"isha\\\": 5, \\\"rakats\\\": 10, \\\"daily\\\": 5, \\\"jumma\\\": 5, \\\"namazejummah\\\": 9, \\\"jummah\\\": 7, \\\"friday\\\": 5, \\\"steps\\\": 4, \\\"offer\\\": 4, \\\"home\\\": 8, \\\"namazejumma\\\": 2, \\\"tahajjud\\\": 10, \\\"tahajjad\\\": 1, \\\"prepare\\\": 1, \\\"preparations\\\": 1, \\\"tarawih\\\": 14, \\\"rakat\\\": 1, \\\"whole\\\": 1, \\\"during\\\": 19, \\\"hold\\\": 2, \\\"while\\\": 11, \\\"praying\\\": 7, \\\"lead\\\": 1, \\\"special\\\": 4, \\\"dua\\\": 4, \\\"reward\\\": 2, \\\"perpare\\\": 2, \\\"missing\\\": 1, \\\"individually\\\": 2, \\\"timings\\\": 2, \\\"pay\\\": 2, \\\"fitrana\\\": 4, \\\"fitra\\\": 2, \\\"eating\\\": 1, \\\"eidulfitr\\\": 2, \\\"eiduladha\\\": 2, \\\"required\\\": 2, \\\"performing\\\": 5, \\\"break\\\": 7, \\\"change\\\": 2, \\\"clothes\\\": 3, \\\"wudhu\\\": 3, \\\"socks\\\": 3, \\\"ghusl\\\": 14, \\\"step\\\": 4, \\\"acts\\\": 7, \\\"considered\\\": 7, \\\"appropriate\\\": 4, \\\"taking\\\": 2, \\\"inappropriate\\\": 1, \\\"water\\\": 6, \\\"available\\\": 4, \\\"tayammum\\\": 13, \\\"situations\\\": 4, \\\"done\\\": 2, \\\"after\\\": 4, \\\"making\\\": 3, \\\"nullifies\\\": 2, \\\"laylatalqadr\\\": 2, \\\"laylat\\\": 6, \\\"alqadr\\\": 6, \\\"rewards\\\": 3, \\\"long\\\": 2, \\\"zakat\\\": 29, \\\"charity\\\": 2, \\\"vs\\\": 1, \\\"imprtance\\\": 5, \\\"principals\\\": 2, \\\"giving\\\": 2, \\\"almal\\\": 2, \\\"alfitr\\\": 2, \\\"distribution\\\": 2, \\\"distribute\\\": 1, \\\"recipients\\\": 2, \\\"nisab\\\": 2, \\\"gold\\\": 2, \\\"silver\\\": 2, \\\"wealth\\\": 2, \\\"ushr\\\": 2, \\\"sayam\\\": 3, \\\"roza\\\": 12, \\\"sawm\\\": 10, \\\"mportance\\\": 1, \\\"fasting\\\": 27, \\\"excused\\\": 6, \\\"excluded\\\": 9, \\\"ramadan\\\": 5, \\\"actions\\\": 10, \\\"invalidate\\\": 11, \\\"nullify\\\": 9, \\\"fast\\\": 20, \\\"tablets\\\": 2, \\\"drops\\\": 2, \\\"injections\\\": 2, \\\"patches\\\": 2, \\\"whilst\\\": 2, \\\"dialysis\\\": 2, \\\"nose\\\": 3, \\\"bleeds\\\": 3, \\\"mouthwash\\\": 2, \\\"gargles\\\": 2, \\\"creams\\\": 2, \\\"ointments\\\": 2, \\\"diabetes\\\": 3, \\\"medical\\\": 3, \\\"inhaler\\\": 2, \\\"swimming\\\": 1, \\\"breaks\\\": 1, \\\"swiming\\\": 1, \\\"smoke\\\": 2, \\\"smoking\\\": 1, \\\"brush\\\": 3, \\\"teeth\\\": 3, \\\"bath\\\": 2, \\\"forbidden\\\": 6, \\\"4\\\": 1, \\\"reasons\\\": 3, \\\"suhur\\\": 3, \\\"iftar\\\": 3, \\\"festival\\\": 1, \\\"celebrates\\\": 1, \\\"completion\\\": 1, \\\"actual\\\": 1, \\\"jihad\\\": 15, \\\"greater\\\": 8, \\\"teaches\\\": 2, \\\"expects\\\": 2, \\\"lesser\\\": 2, \\\"gum\\\": 1, \\\"hajj\\\": 40, \\\"mean\\\": 2, \\\"word\\\": 1, \\\"enough\\\": 1, \\\"pilgrimage\\\": 6, \\\"essentail\\\": 2, \\\"whom\\\": 2, \\\"rituals\\\": 3, \\\"umrah\\\": 4, \\\"duration\\\": 2, \\\"occur\\\": 2, \\\"same\\\": 2, \\\"dates\\\": 3, \\\"every\\\": 2, \\\"clothing\\\": 7, \\\"rules\\\": 3, \\\"woman\\\": 2, \\\"alone\\\": 2, \\\"limit\\\": 2, \\\"cover\\\": 3, \\\"face\\\": 2, \\\"non\\\": 1, \\\"person\\\": 1, \\\"ihram\\\": 19, \\\"likelihood\\\": 1, \\\"bleeding\\\": 1, \\\"men\\\\u2019s\\\": 1, \\\"wear\\\": 4, \\\"these\\\": 1, \\\"state\\\": 5, \\\"permitted\\\": 2, \\\"youve\\\": 1, \\\"act\\\": 2, \\\"restrictions\\\": 2, \\\"lifted\\\": 2, \\\"holiest\\\": 8, \\\"city\\\": 11, \\\"sacred\\\": 2, \\\"significance\\\": 4, \\\"consider\\\": 2, \\\"as\\\": 1, \\\"traditional\\\": 1, \\\"foods\\\": 1, \\\"eaten\\\": 1, \\\"holidays\\\": 1, \\\"teachings\\\": 11, \\\"kindness\\\": 4, \\\"regarding\\\": 7, \\\"emphasize\\\": 2, \\\"teach\\\": 2, \\\"examples\\\": 4, \\\"art\\\": 5, \\\"architecture\\\": 5, \\\"associated\\\": 2, \\\"would\\\": 1, \\\"more\\\": 1, \\\"crescent\\\": 5, \\\"moon\\\": 5, \\\"symbolize\\\": 1, \\\"associate\\\": 1, \\\"their\\\": 2, \\\"play\\\": 1, \\\"culture\\\": 2, \\\"reason\\\": 2, \\\"behind\\\": 2, \\\"wearing\\\": 2, \\\"hijab\\\": 5, \\\"certain\\\": 1, \\\"hair\\\": 1, \\\"motivates\\\": 1, \\\"permissible\\\": 10, \\\"boyfriends\\\": 2, \\\"engage\\\": 1, \\\"romantic\\\": 2, \\\"relationships\\\": 1, \\\"stance\\\": 5, \\\"allowed\\\": 15, \\\"dating\\\": 1, \\\"girlfriends\\\": 4, \\\"view\\\": 6, \\\"individuals\\\": 2, \\\"relationship\\\": 1, \\\"marriage\\\": 1, \\\"respect\\\": 5, \\\"showing\\\": 1, \\\"deal\\\": 5, \\\"stress\\\": 7, \\\"handle\\\": 7, \\\"managed\\\": 1, \\\"ways\\\": 1, \\\"managing\\\": 2, \\\"management\\\": 1, \\\"sadness\\\": 7, \\\"perspective\\\": 8, \\\"dealing\\\": 2, \\\"manage\\\": 1, \\\"feelings\\\": 1, \\\"coping\\\": 1, \\\"guide\\\": 1, \\\"handling\\\": 3, \\\"illness\\\": 5, \\\"approach\\\": 2, \\\"address\\\": 2, \\\"guidance\\\": 2, \\\"sickness\\\": 1, \\\"sick\\\": 1, \\\"addiction\\\": 14, \\\"dealt\\\": 1, \\\"overcoming\\\": 1, \\\"sports\\\": 12, \\\"engaging\\\": 1, \\\"participating\\\": 1, \\\"main\\\": 1, \\\"holds\\\": 1, \\\"highest\\\": 1, \\\"revered\\\": 2, \\\"situated\\\": 1, \\\"found\\\": 1, \\\"located\\\": 1, \\\"offering\\\": 1, \\\"basis\\\": 1, \\\"determined\\\": 1, \\\"rely\\\": 1, \\\"determines\\\": 1, \\\"start\\\": 1, \\\"governs\\\": 1, \\\"celebrate\\\": 3, \\\"traditions\\\": 1, \\\"typical\\\": 2, \\\"way\\\": 2, \\\"customs\\\": 1, \\\"things\\\": 1, \\\"symbols\\\": 5, \\\"commonly\\\": 1, \\\"used\\\": 2, \\\"significant\\\": 1, \\\"common\\\": 3, \\\"famous\\\": 2, \\\"mosques\\\": 6, \\\"wellknown\\\": 1, \\\"around\\\": 1, \\\"world\\\": 1, \\\"popular\\\": 1, \\\"worldwide\\\": 1, \\\"renowned\\\": 1, \\\"notable\\\": 1, \\\"countries\\\": 1, \\\"greet\\\": 3, \\\"greeting\\\": 2, \\\"among\\\": 1, \\\"customary\\\": 1, \\\"another\\\": 1, \\\"exchange\\\": 1, \\\"greetings\\\": 2, \\\"nonmuslims\\\": 4, \\\"salam\\\": 5, \\\"religions\\\": 1, \\\"encouraged\\\": 4, \\\"recommended\\\": 2, \\\"movies\\\": 7, \\\"watching\\\": 10, \\\"watch\\\": 10, \\\"according\\\": 3, \\\"tv\\\": 6, \\\"series\\\": 6, \\\"shows\\\": 1, \\\"television\\\": 1, \\\"music\\\": 7, \\\"listen\\\": 1, \\\"anime\\\": 7, \\\"cartoon\\\": 2, \\\"cartoons\\\": 5, \\\"drawing\\\": 7, \\\"faces\\\": 5, \\\"draw\\\": 2, \\\"create\\\": 1, \\\"drawings\\\": 1, \\\"human\\\": 1, \\\"living\\\": 5, \\\"beings\\\": 4, \\\"pictures\\\": 1, \\\"creatures\\\": 1, \\\"delay\\\": 2, \\\"skip\\\": 2, \\\"under\\\": 1, \\\"circumstances\\\": 1, \\\"leave\\\": 1, \\\"valid\\\": 1, \\\"excuses\\\": 1, \\\"postpone\\\": 1, \\\"sins\\\": 10, \\\"minor\\\": 5, \\\"ruqya\\\": 6, \\\"practiced\\\": 1, \\\"greeted\\\": 1, \\\"nonmuslim\\\": 5, \\\"assalaamu\\\": 5, \\\"alaykum\\\": 5, \\\"response\\\": 1, \\\"return\\\": 1, \\\"greets\\\": 1, \\\"reply\\\": 2}\", \"word_docs\": \"{\\\"there\\\": 62, \\\"hi\\\": 6, \\\"hey\\\": 5, \\\"hello\\\": 5, \\\"how\\\": 211, \\\"feeling\\\": 10, \\\"are\\\": 298, \\\"you\\\": 168, \\\"today\\\": 16, \\\"doing\\\": 13, \\\"can\\\": 97, \\\"i\\\": 61, \\\"help\\\": 7, \\\"been\\\": 9, \\\"have\\\": 71, \\\"see\\\": 6, \\\"to\\\": 128, \\\"good\\\": 14, \\\"hallo\\\": 1, \\\"halo\\\": 1, \\\"hola\\\": 1, \\\"wassup\\\": 1, \\\"up\\\": 3, \\\"whats\\\": 9, \\\"sup\\\": 1, \\\"yo\\\": 1, \\\"howdy\\\": 2, \\\"assalamualaikum\\\": 2, \\\"assalamu\\\": 1, \\\"alaikum\\\": 5, \\\"assalam\\\": 1, \\\"u\\\": 4, \\\"asalamualikum\\\": 2, \\\"asalamu\\\": 2, \\\"alikum\\\": 4, \\\"asalam\\\": 3, \\\"aslamualikum\\\": 2, \\\"aslamu\\\": 1, \\\"aslam\\\": 1, \\\"asalamualaikum\\\": 2, \\\"peace\\\": 2, \\\"upon\\\": 2, \\\"be\\\": 12, \\\"and\\\": 69, \\\"wa\\\": 1, \\\"fine\\\": 13, \\\"great\\\": 23, \\\"fantastic\\\": 5, \\\"well\\\": 10, \\\"im\\\": 15, \\\"am\\\": 18, \\\"cant\\\": 2, \\\"complain\\\": 1, \\\"was\\\": 35, \\\"day\\\": 53, \\\"my\\\": 37, \\\"is\\\": 353, \\\"going\\\": 13, \\\"yours\\\": 21, \\\"about\\\": 80, \\\"what\\\": 496, \\\"everything\\\": 1, \\\"hows\\\": 1, \\\"its\\\": 4, \\\"days\\\": 4, \\\"just\\\": 1, \\\"one\\\": 15, \\\"those\\\": 1, \\\"of\\\": 523, \\\"overwhelmed\\\": 3, \\\"not\\\": 18, \\\"a\\\": 92, \\\"so\\\": 5, \\\"far\\\": 1, \\\"rough\\\": 4, \\\"bit\\\": 5, \\\"struggling\\\": 3, \\\"down\\\": 3, \\\"it\\\": 20, \\\"could\\\": 3, \\\"better\\\": 4, \\\"tough\\\": 2, \\\"having\\\": 6, \\\"hasnt\\\": 1, \\\"bad\\\": 3, \\\"quite\\\": 1, \\\"pretty\\\": 2, \\\"meh\\\": 1, \\\"in\\\": 234, \\\"trying\\\": 2, \\\"hang\\\": 1, \\\"honest\\\": 2, \\\"hanging\\\": 1, \\\"thanks\\\": 5, \\\"for\\\": 49, \\\"asking\\\": 1, \\\"had\\\": 48, \\\"ive\\\": 1, \\\"but\\\": 4, \\\"through\\\": 1, \\\"getting\\\": 1, \\\"stay\\\": 1, \\\"positive\\\": 1, \\\"struggle\\\": 1, \\\"right\\\": 8, \\\"now\\\": 9, \\\"tomorrow\\\": 1, \\\"hoping\\\": 1, \\\"will\\\": 15, \\\"really\\\": 1, \\\"myself\\\": 1, \\\"time\\\": 15, \\\"cope\\\": 1, \\\"best\\\": 6, \\\"farewell\\\": 1, \\\"next\\\": 2, \\\"until\\\": 1, \\\"bye\\\": 2, \\\"later\\\": 1, \\\"goodbye\\\": 1, \\\"chatting\\\": 1, \\\"nice\\\": 1, \\\"till\\\": 1, \\\"hafiz\\\": 2, \\\"allah\\\": 13, \\\"khuda\\\": 1, \\\"grateful\\\": 1, \\\"much\\\": 5, \\\"thank\\\": 2, \\\"appreciate\\\": 1, \\\"many\\\": 118, \\\"helpful\\\": 2, \\\"thats\\\": 1, \\\"awesome\\\": 1, \\\"me\\\": 48, \\\"helping\\\": 1, \\\"tell\\\": 27, \\\"joke\\\": 3, \\\"give\\\": 3, \\\"do\\\": 102, \\\"know\\\": 20, \\\"jokes\\\": 2, \\\"any\\\": 29, \\\"need\\\": 2, \\\"make\\\": 2, \\\"laugh\\\": 1, \\\"win\\\": 1, \\\"the\\\": 301, \\\"scarecrow\\\": 1, \\\"an\\\": 3, \\\"why\\\": 60, \\\"award\\\": 1, \\\"did\\\": 61, \\\"eyes\\\": 3, \\\"fish\\\": 1, \\\"with\\\": 33, \\\"no\\\": 1, \\\"call\\\": 2, \\\"skeletons\\\": 2, \\\"dont\\\": 5, \\\"other\\\": 27, \\\"fight\\\": 2, \\\"each\\\": 8, \\\"math\\\": 1, \\\"sad\\\": 1, \\\"book\\\": 1, \\\"catch\\\": 1, \\\"squirrel\\\": 1, \\\"letter\\\": 1, \\\"favorite\\\": 1, \\\"pirates\\\": 1, \\\"tomato\\\": 1, \\\"red\\\": 1, \\\"turn\\\": 1, \\\"say\\\": 20, \\\"wall\\\": 2, \\\"over\\\": 4, \\\"fall\\\": 1, \\\"bicycle\\\": 1, \\\"eight\\\": 1, \\\"zero\\\": 1, \\\"trust\\\": 1, \\\"scientists\\\": 1, \\\"atoms\\\": 1, \\\"dance\\\": 1, \\\"tissue\\\": 1, \\\"eggs\\\": 1, \\\"snowman\\\": 2, \\\"sixpack\\\": 1, \\\"if\\\": 13, \\\"vampire\\\": 1, \\\"get\\\": 4, \\\"cross\\\": 1, \\\"pants\\\": 1, \\\"golfer\\\": 1, \\\"bring\\\": 1, \\\"pairs\\\": 1, \\\"two\\\": 2, \\\"go\\\": 2, \\\"doctor\\\": 1, \\\"cookie\\\": 1, \\\"does\\\": 37, \\\"eat\\\": 6, \\\"train\\\": 1, \\\"story\\\": 21, \\\"share\\\": 5, \\\"hear\\\": 7, \\\"want\\\": 8, \\\"stories\\\": 8, \\\"bedtime\\\": 2, \\\"sleep\\\": 3, \\\"fairy\\\": 3, \\\"tale\\\": 2, \\\"tales\\\": 1, \\\"love\\\": 5, \\\"magical\\\": 3, \\\"animals\\\": 6, \\\"animal\\\": 1, \\\"friendship\\\": 1, \\\"friends\\\": 2, \\\"bravery\\\": 1, \\\"hero\\\": 1, \\\"courage\\\": 1, \\\"magic\\\": 2, \\\"nature\\\": 1, \\\"outdoors\\\": 1, \\\"forest\\\": 1, \\\"set\\\": 1, \\\"outer\\\": 1, \\\"space\\\": 1, \\\"astronauts\\\": 1, \\\"planets\\\": 1, \\\"kingdom\\\": 1, \\\"princesses\\\": 1, \\\"castles\\\": 1, \\\"land\\\": 1, \\\"your\\\": 26, \\\"occupation\\\": 1, \\\"who\\\": 47, \\\"introduction\\\": 2, \\\"purpose\\\": 6, \\\"capabilities\\\": 2, \\\"provide\\\": 4, \\\"kind\\\": 3, \\\"assistance\\\": 1, \\\"called\\\": 1, \\\"like\\\": 7, \\\"name\\\": 12, \\\"title\\\": 1, \\\"use\\\": 13, \\\"should\\\": 15, \\\"refer\\\": 1, \\\"alsiraj\\\": 5, \\\"signify\\\": 1, \\\"islam\\\": 214, \\\"exactly\\\": 1, \\\"by\\\": 15, \\\"meant\\\": 8, \\\"age\\\": 9, \\\"old\\\": 2, \\\"where\\\": 26, \\\"live\\\": 6, \\\"from\\\": 20, \\\"married\\\": 5, \\\"spouse\\\": 1, \\\"wife\\\": 1, \\\"husband\\\": 1, \\\"children\\\": 23, \\\"languages\\\": 8, \\\"speak\\\": 4, \\\"which\\\": 24, \\\"only\\\": 2, \\\"english\\\": 6, \\\"than\\\": 7, \\\"understand\\\": 2, \\\"able\\\": 4, \\\"respond\\\": 3, \\\"urdu\\\": 3, \\\"goal\\\": 2, \\\"goals\\\": 1, \\\"aim\\\": 2, \\\"aims\\\": 1, \\\"mission\\\": 3, \\\"busy\\\": 5, \\\"talk\\\": 2, \\\"free\\\": 6, \\\"chat\\\": 2, \\\"moment\\\": 2, \\\"currently\\\": 1, \\\"assist\\\": 1, \\\"question\\\": 1, \\\"ask\\\": 1, \\\"spare\\\": 1, \\\"some\\\": 18, \\\"at\\\": 12, \\\"chatbots\\\": 1, \\\"chatbot\\\": 3, \\\"think\\\": 3, \\\"on\\\": 32, \\\"or\\\": 32, \\\"thoughts\\\": 2, \\\"opinions\\\": 1, \\\"opinion\\\": 1, \\\"anything\\\": 1, \\\"something\\\": 5, \\\"weather\\\": 2, \\\"week\\\": 3, \\\"this\\\": 1, \\\"date\\\": 5, \\\"recognize\\\": 2, \\\"guess\\\": 1, \\\"we\\\": 38, \\\"talked\\\": 5, \\\"still\\\": 2, \\\"remember\\\": 9, \\\"recall\\\": 11, \\\"our\\\": 3, \\\"conversation\\\": 2, \\\"discussed\\\": 1, \\\"yesturday\\\": 3, \\\"before\\\": 15, \\\"chatted\\\": 3, \\\"interacted\\\": 1, \\\"previous\\\": 11, \\\"conversations\\\": 3, \\\"interactions\\\": 1, \\\"information\\\": 7, \\\"all\\\": 3, \\\"store\\\": 3, \\\"asked\\\": 3, \\\"save\\\": 2, \\\"keep\\\": 2, \\\"history\\\": 4, \\\"data\\\": 2, \\\"interaction\\\": 1, \\\"people\\\": 3, \\\"once\\\": 2, \\\"humans\\\": 6, \\\"support\\\": 1, \\\"offered\\\": 1, \\\"choose\\\": 2, \\\"follow\\\": 1, \\\"meaning\\\": 23, \\\"wordly\\\": 4, \\\"fact\\\": 4, \\\"facts\\\": 1, \\\"interesting\\\": 1, \\\"learn\\\": 3, \\\"may\\\": 1, \\\"god\\\": 2, \\\"gods\\\": 1, \\\"names\\\": 35, \\\"anyone\\\": 4, \\\"when\\\": 48, \\\"look\\\": 2, \\\"us\\\": 5, \\\"angels\\\": 13, \\\"created\\\": 3, \\\"made\\\": 9, \\\"roles\\\": 1, \\\"numbers\\\": 29, \\\"known\\\": 6, \\\"jibril\\\": 4, \\\"role\\\": 27, \\\"israfel\\\": 6, \\\"trumpet\\\": 8, \\\"blow\\\": 6, \\\"soor\\\": 8, \\\"times\\\": 13, \\\"azrael\\\": 4, \\\"mikail\\\": 4, \\\"kiraman\\\": 4, \\\"katibin\\\": 4, \\\"muqarrabun\\\": 4, \\\"nakir\\\": 4, \\\"munkar\\\": 4, \\\"archangel\\\": 4, \\\"gabriel\\\": 3, \\\"gabriell\\\": 1, \\\"angel\\\": 10, \\\"death\\\": 4, \\\"michael\\\": 4, \\\"jinns\\\": 24, \\\"concept\\\": 5, \\\"real\\\": 4, \\\"powers\\\": 4, \\\"types\\\": 20, \\\"list\\\": 22, \\\"food\\\": 8, \\\"type\\\": 2, \\\"dwelling\\\": 2, \\\"places\\\": 3, \\\"muslims\\\": 63, \\\"disbelievers\\\": 4, \\\"believers\\\": 2, \\\"ghosts\\\": 24, \\\"prophets\\\": 14, \\\"total\\\": 2, \\\"quran\\\": 98, \\\"jesus\\\": 4, \\\"says\\\": 4, \\\"prophet\\\": 35, \\\"last\\\": 3, \\\"pbuh\\\": 107, \\\"muhammad\\\": 170, \\\"means\\\": 2, \\\"term\\\": 1, \\\"stands\\\": 1, \\\"hazrat\\\": 54, \\\"muhammads\\\": 6, \\\"matter\\\": 1, \\\"using\\\": 3, \\\"necessary\\\": 5, \\\"essential\\\": 2, \\\"important\\\": 23, \\\"compulsory\\\": 18, \\\"born\\\": 2, \\\"place\\\": 10, \\\"birth\\\": 2, \\\"died\\\": 10, \\\"he\\\": 2, \\\"mother\\\": 10, \\\"mom\\\": 2, \\\"pbuhs\\\": 5, \\\"father\\\": 16, \\\"dad\\\": 4, \\\"were\\\": 2, \\\"parents\\\": 10, \\\"ever\\\": 8, \\\"wives\\\": 28, \\\"has\\\": 6, \\\"number\\\": 31, \\\"his\\\": 14, \\\"kids\\\": 21, \\\"daughters\\\": 26, \\\"sons\\\": 26, \\\"companions\\\": 6, \\\"sahabah\\\": 2, \\\"sahaba\\\": 2, \\\"muslim\\\": 24, \\\"become\\\": 8, \\\"words\\\": 2, \\\"holy\\\": 22, \\\"scrolls\\\": 3, \\\"scroll\\\": 12, \\\"abraham\\\": 3, \\\"moses\\\": 3, \\\"ibrahim\\\": 3, \\\"musa\\\": 3, \\\"books\\\": 12, \\\"scriptures\\\": 13, \\\"gospel\\\": 2, \\\"injil\\\": 2, \\\"zabur\\\": 2, \\\"torah\\\": 2, \\\"tawrat\\\": 2, \\\"koran\\\": 4, \\\"difference\\\": 12, \\\"between\\\": 12, \\\"proof\\\": 2, \\\"that\\\": 13, \\\"unchanged\\\": 1, \\\"corrupted\\\": 1, \\\"oldest\\\": 1, \\\"fragments\\\": 1, \\\"chapters\\\": 21, \\\"surah\\\": 10, \\\"verses\\\": 30, \\\"ayah\\\": 31, \\\"ayat\\\": 9, \\\"excluding\\\": 6, \\\"bismillah\\\": 12, \\\"including\\\": 6, \\\"ayats\\\": 22, \\\"sajdah\\\": 13, \\\"e\\\": 10, \\\"ayatesajdah\\\": 1, \\\"ayahesajdah\\\": 1, \\\"adoration\\\": 4, \\\"sajdad\\\": 1, \\\"makki\\\": 20, \\\"surahs\\\": 12, \\\"mecca\\\": 15, \\\"meccan\\\": 16, \\\"madani\\\": 20, \\\"madinan\\\": 20, \\\"imam\\\": 3, \\\"imams\\\": 5, \\\"four\\\": 2, \\\"qiyamah\\\": 4, \\\"coming\\\": 5, \\\"qayamah\\\": 5, \\\"qiyamat\\\": 5, \\\"judgment\\\": 5, \\\"qayamat\\\": 4, \\\"arrive\\\": 5, \\\"months\\\": 4, \\\"calendar\\\": 6, \\\"islamic\\\": 33, \\\"dest\\\": 1, \\\"month\\\": 6, \\\"year\\\": 3, \\\"halal\\\": 9, \\\"haram\\\": 12, \\\"major\\\": 8, \\\"beliefs\\\": 3, \\\"study\\\": 2, \\\"seerah\\\": 2, \\\"kabah\\\": 6, \\\"built\\\": 2, \\\"location\\\": 2, \\\"qibla\\\": 6, \\\"first\\\": 45, \\\"current\\\": 1, \\\"masjid\\\": 2, \\\"mosque\\\": 2, \\\"worship\\\": 3, \\\"shahada\\\": 13, \\\"importance\\\": 40, \\\"pillar\\\": 49, \\\"faith\\\": 45, \\\"profession\\\": 43, \\\"parts\\\": 14, \\\"2\\\": 3, \\\"consist\\\": 3, \\\"conditions\\\": 16, \\\"shahadah\\\": 39, \\\"being\\\": 5, \\\"condition\\\": 81, \\\"explain\\\": 31, \\\"second\\\": 11, \\\"third\\\": 13, \\\"fourth\\\": 12, \\\"fifth\\\": 11, \\\"sixth\\\": 9, \\\"seventh\\\": 9, \\\"eighth\\\": 9, \\\"ninth\\\": 9, \\\"often\\\": 1, \\\"life\\\": 2, \\\"reciting\\\": 3, \\\"benefits\\\": 38, \\\"recite\\\": 4, \\\"most\\\": 6, \\\"makes\\\": 3, \\\"cannot\\\": 1, \\\"without\\\": 4, \\\"take\\\": 7, \\\"salah\\\": 28, \\\"salat\\\": 12, \\\"namaz\\\": 27, \\\"prayers\\\": 25, \\\"obligatory\\\": 5, \\\"fard\\\": 2, \\\"wajib\\\": 2, \\\"sunni\\\": 2, \\\"sunnah\\\": 2, \\\"voluntary\\\": 2, \\\"nafl\\\": 2, \\\"five\\\": 13, \\\"perform\\\": 22, \\\"prayer\\\": 63, \\\"stepbystep\\\": 7, \\\"rakah\\\": 3, \\\"wudu\\\": 23, \\\"wo\\\": 3, \\\"5\\\": 6, \\\"different\\\": 9, \\\"postures\\\": 6, \\\"miss\\\": 5, \\\"missed\\\": 3, \\\"namz\\\": 1, \\\"eid\\\": 30, \\\"pray\\\": 17, \\\"area\\\": 3, \\\"men\\\": 9, \\\"women\\\": 17, \\\"fajar\\\": 5, \\\"benefit\\\": 15, \\\"zuhar\\\": 5, \\\"asar\\\": 5, \\\"maghrib\\\": 5, \\\"isha\\\": 5, \\\"rakats\\\": 10, \\\"daily\\\": 5, \\\"jumma\\\": 5, \\\"namazejummah\\\": 9, \\\"jummah\\\": 7, \\\"friday\\\": 5, \\\"offer\\\": 4, \\\"steps\\\": 4, \\\"home\\\": 8, \\\"namazejumma\\\": 2, \\\"tahajjud\\\": 10, \\\"tahajjad\\\": 1, \\\"prepare\\\": 1, \\\"preparations\\\": 1, \\\"tarawih\\\": 14, \\\"rakat\\\": 1, \\\"whole\\\": 1, \\\"during\\\": 19, \\\"hold\\\": 2, \\\"while\\\": 11, \\\"praying\\\": 7, \\\"lead\\\": 1, \\\"special\\\": 4, \\\"dua\\\": 4, \\\"reward\\\": 2, \\\"perpare\\\": 2, \\\"missing\\\": 1, \\\"individually\\\": 2, \\\"timings\\\": 2, \\\"pay\\\": 2, \\\"fitra\\\": 2, \\\"fitrana\\\": 4, \\\"eating\\\": 1, \\\"eidulfitr\\\": 2, \\\"eiduladha\\\": 2, \\\"required\\\": 2, \\\"performing\\\": 5, \\\"break\\\": 7, \\\"change\\\": 2, \\\"clothes\\\": 3, \\\"wudhu\\\": 3, \\\"socks\\\": 3, \\\"ghusl\\\": 14, \\\"step\\\": 2, \\\"appropriate\\\": 4, \\\"acts\\\": 7, \\\"taking\\\": 2, \\\"considered\\\": 7, \\\"inappropriate\\\": 1, \\\"available\\\": 4, \\\"water\\\": 6, \\\"tayammum\\\": 13, \\\"done\\\": 2, \\\"situations\\\": 4, \\\"after\\\": 4, \\\"making\\\": 3, \\\"nullifies\\\": 2, \\\"laylatalqadr\\\": 2, \\\"alqadr\\\": 6, \\\"rewards\\\": 3, \\\"laylat\\\": 6, \\\"long\\\": 2, \\\"zakat\\\": 29, \\\"charity\\\": 2, \\\"vs\\\": 1, \\\"imprtance\\\": 5, \\\"principals\\\": 2, \\\"giving\\\": 2, \\\"almal\\\": 2, \\\"alfitr\\\": 2, \\\"distribution\\\": 2, \\\"distribute\\\": 1, \\\"recipients\\\": 2, \\\"nisab\\\": 2, \\\"gold\\\": 2, \\\"silver\\\": 2, \\\"wealth\\\": 2, \\\"ushr\\\": 2, \\\"roza\\\": 12, \\\"sayam\\\": 3, \\\"sawm\\\": 10, \\\"fasting\\\": 27, \\\"mportance\\\": 1, \\\"ramadan\\\": 5, \\\"excused\\\": 6, \\\"excluded\\\": 9, \\\"actions\\\": 10, \\\"nullify\\\": 9, \\\"invalidate\\\": 11, \\\"fast\\\": 20, \\\"injections\\\": 2, \\\"patches\\\": 2, \\\"drops\\\": 2, \\\"tablets\\\": 2, \\\"whilst\\\": 2, \\\"dialysis\\\": 2, \\\"nose\\\": 3, \\\"bleeds\\\": 3, \\\"mouthwash\\\": 2, \\\"gargles\\\": 2, \\\"ointments\\\": 2, \\\"creams\\\": 2, \\\"medical\\\": 3, \\\"diabetes\\\": 3, \\\"inhaler\\\": 2, \\\"swimming\\\": 1, \\\"breaks\\\": 1, \\\"swiming\\\": 1, \\\"smoke\\\": 2, \\\"smoking\\\": 1, \\\"brush\\\": 3, \\\"teeth\\\": 3, \\\"bath\\\": 2, \\\"forbidden\\\": 6, \\\"4\\\": 1, \\\"reasons\\\": 3, \\\"suhur\\\": 3, \\\"iftar\\\": 3, \\\"completion\\\": 1, \\\"festival\\\": 1, \\\"celebrates\\\": 1, \\\"actual\\\": 1, \\\"jihad\\\": 15, \\\"greater\\\": 8, \\\"teaches\\\": 2, \\\"expects\\\": 2, \\\"lesser\\\": 2, \\\"gum\\\": 1, \\\"hajj\\\": 40, \\\"mean\\\": 2, \\\"word\\\": 1, \\\"enough\\\": 1, \\\"pilgrimage\\\": 6, \\\"essentail\\\": 2, \\\"whom\\\": 2, \\\"rituals\\\": 3, \\\"umrah\\\": 4, \\\"duration\\\": 2, \\\"dates\\\": 3, \\\"same\\\": 2, \\\"every\\\": 2, \\\"occur\\\": 2, \\\"clothing\\\": 7, \\\"rules\\\": 3, \\\"woman\\\": 2, \\\"alone\\\": 2, \\\"limit\\\": 2, \\\"cover\\\": 3, \\\"face\\\": 2, \\\"non\\\": 1, \\\"likelihood\\\": 1, \\\"ihram\\\": 19, \\\"person\\\": 1, \\\"bleeding\\\": 1, \\\"men\\\\u2019s\\\": 1, \\\"wear\\\": 4, \\\"these\\\": 1, \\\"state\\\": 5, \\\"permitted\\\": 2, \\\"youve\\\": 1, \\\"act\\\": 2, \\\"lifted\\\": 2, \\\"restrictions\\\": 2, \\\"city\\\": 11, \\\"holiest\\\": 8, \\\"sacred\\\": 2, \\\"significance\\\": 4, \\\"consider\\\": 2, \\\"as\\\": 1, \\\"traditional\\\": 1, \\\"eaten\\\": 1, \\\"holidays\\\": 1, \\\"foods\\\": 1, \\\"kindness\\\": 4, \\\"teachings\\\": 11, \\\"regarding\\\": 7, \\\"emphasize\\\": 2, \\\"teach\\\": 2, \\\"examples\\\": 4, \\\"architecture\\\": 5, \\\"art\\\": 5, \\\"associated\\\": 2, \\\"would\\\": 1, \\\"more\\\": 1, \\\"crescent\\\": 5, \\\"moon\\\": 5, \\\"symbolize\\\": 1, \\\"their\\\": 2, \\\"associate\\\": 1, \\\"culture\\\": 2, \\\"play\\\": 1, \\\"reason\\\": 2, \\\"hijab\\\": 5, \\\"behind\\\": 2, \\\"wearing\\\": 2, \\\"certain\\\": 1, \\\"hair\\\": 1, \\\"motivates\\\": 1, \\\"boyfriends\\\": 2, \\\"permissible\\\": 10, \\\"relationships\\\": 1, \\\"engage\\\": 1, \\\"romantic\\\": 2, \\\"stance\\\": 5, \\\"allowed\\\": 15, \\\"dating\\\": 1, \\\"girlfriends\\\": 4, \\\"view\\\": 6, \\\"individuals\\\": 2, \\\"relationship\\\": 1, \\\"marriage\\\": 1, \\\"respect\\\": 5, \\\"showing\\\": 1, \\\"deal\\\": 5, \\\"stress\\\": 7, \\\"handle\\\": 7, \\\"managed\\\": 1, \\\"ways\\\": 1, \\\"managing\\\": 2, \\\"management\\\": 1, \\\"sadness\\\": 7, \\\"dealing\\\": 2, \\\"perspective\\\": 8, \\\"manage\\\": 1, \\\"feelings\\\": 1, \\\"coping\\\": 1, \\\"guide\\\": 1, \\\"handling\\\": 3, \\\"illness\\\": 5, \\\"approach\\\": 2, \\\"address\\\": 2, \\\"sickness\\\": 1, \\\"guidance\\\": 2, \\\"sick\\\": 1, \\\"addiction\\\": 14, \\\"dealt\\\": 1, \\\"overcoming\\\": 1, \\\"sports\\\": 12, \\\"engaging\\\": 1, \\\"participating\\\": 1, \\\"main\\\": 1, \\\"holds\\\": 1, \\\"highest\\\": 1, \\\"situated\\\": 1, \\\"revered\\\": 2, \\\"found\\\": 1, \\\"located\\\": 1, \\\"offering\\\": 1, \\\"basis\\\": 1, \\\"determined\\\": 1, \\\"rely\\\": 1, \\\"determines\\\": 1, \\\"start\\\": 1, \\\"governs\\\": 1, \\\"celebrate\\\": 3, \\\"traditions\\\": 1, \\\"typical\\\": 2, \\\"way\\\": 2, \\\"customs\\\": 1, \\\"things\\\": 1, \\\"symbols\\\": 5, \\\"commonly\\\": 1, \\\"used\\\": 2, \\\"significant\\\": 1, \\\"common\\\": 3, \\\"famous\\\": 2, \\\"mosques\\\": 6, \\\"world\\\": 1, \\\"wellknown\\\": 1, \\\"around\\\": 1, \\\"popular\\\": 1, \\\"worldwide\\\": 1, \\\"renowned\\\": 1, \\\"notable\\\": 1, \\\"countries\\\": 1, \\\"greet\\\": 3, \\\"among\\\": 1, \\\"greeting\\\": 2, \\\"another\\\": 1, \\\"customary\\\": 1, \\\"greetings\\\": 2, \\\"exchange\\\": 1, \\\"salam\\\": 5, \\\"nonmuslims\\\": 4, \\\"religions\\\": 1, \\\"encouraged\\\": 4, \\\"recommended\\\": 2, \\\"movies\\\": 7, \\\"watching\\\": 10, \\\"watch\\\": 10, \\\"according\\\": 3, \\\"series\\\": 6, \\\"tv\\\": 6, \\\"shows\\\": 1, \\\"television\\\": 1, \\\"music\\\": 7, \\\"listen\\\": 1, \\\"anime\\\": 7, \\\"cartoon\\\": 2, \\\"cartoons\\\": 5, \\\"drawing\\\": 7, \\\"faces\\\": 5, \\\"draw\\\": 2, \\\"drawings\\\": 1, \\\"create\\\": 1, \\\"human\\\": 1, \\\"beings\\\": 4, \\\"living\\\": 5, \\\"pictures\\\": 1, \\\"creatures\\\": 1, \\\"delay\\\": 2, \\\"skip\\\": 2, \\\"circumstances\\\": 1, \\\"under\\\": 1, \\\"leave\\\": 1, \\\"excuses\\\": 1, \\\"valid\\\": 1, \\\"postpone\\\": 1, \\\"sins\\\": 10, \\\"minor\\\": 5, \\\"ruqya\\\": 6, \\\"practiced\\\": 1, \\\"nonmuslim\\\": 5, \\\"greeted\\\": 1, \\\"alaykum\\\": 5, \\\"assalaamu\\\": 5, \\\"response\\\": 1, \\\"return\\\": 1, \\\"reply\\\": 2, \\\"greets\\\": 1}\", \"index_docs\": \"{\\\"24\\\": 62, \\\"237\\\": 6, \\\"275\\\": 5, \\\"238\\\": 5, \\\"8\\\": 211, \\\"166\\\": 10, \\\"5\\\": 298, \\\"10\\\": 168, \\\"108\\\": 16, \\\"129\\\": 13, \\\"17\\\": 97, \\\"25\\\": 61, \\\"216\\\": 7, \\\"183\\\": 9, \\\"20\\\": 71, \\\"239\\\": 6, \\\"11\\\": 128, \\\"122\\\": 14, \\\"648\\\": 1, \\\"649\\\": 1, \\\"650\\\": 1, \\\"651\\\": 1, \\\"394\\\": 3, \\\"184\\\": 9, \\\"652\\\": 1, \\\"653\\\": 1, \\\"470\\\": 2, \\\"471\\\": 2, \\\"654\\\": 1, \\\"276\\\": 5, \\\"655\\\": 1, \\\"334\\\": 4, \\\"472\\\": 2, \\\"473\\\": 2, \\\"335\\\": 4, \\\"395\\\": 3, \\\"474\\\": 2, \\\"656\\\": 1, \\\"657\\\": 1, \\\"475\\\": 2, \\\"476\\\": 2, \\\"477\\\": 2, \\\"144\\\": 12, \\\"21\\\": 69, \\\"658\\\": 1, \\\"130\\\": 13, \\\"78\\\": 23, \\\"277\\\": 5, \\\"167\\\": 10, \\\"105\\\": 15, \\\"101\\\": 18, \\\"478\\\": 2, \\\"659\\\": 1, \\\"46\\\": 35, \\\"26\\\": 53, \\\"44\\\": 37, \\\"3\\\": 353, \\\"131\\\": 13, \\\"86\\\": 21, \\\"19\\\": 80, \\\"2\\\": 496, \\\"661\\\": 1, \\\"660\\\": 1, \\\"336\\\": 4, \\\"337\\\": 4, \\\"662\\\": 1, \\\"112\\\": 15, \\\"663\\\": 1, \\\"1\\\": 523, \\\"396\\\": 3, \\\"102\\\": 18, \\\"15\\\": 92, \\\"278\\\": 5, \\\"664\\\": 1, \\\"338\\\": 4, \\\"279\\\": 5, \\\"397\\\": 3, \\\"398\\\": 3, \\\"90\\\": 20, \\\"399\\\": 3, \\\"339\\\": 4, \\\"479\\\": 2, \\\"240\\\": 6, \\\"665\\\": 1, \\\"400\\\": 3, \\\"666\\\": 1, \\\"480\\\": 2, \\\"667\\\": 1, \\\"6\\\": 234, \\\"481\\\": 2, \\\"668\\\": 1, \\\"482\\\": 2, \\\"669\\\": 1, \\\"280\\\": 5, \\\"30\\\": 49, \\\"670\\\": 1, \\\"32\\\": 48, \\\"671\\\": 1, \\\"340\\\": 4, \\\"673\\\": 1, \\\"672\\\": 1, \\\"674\\\": 1, \\\"675\\\": 1, \\\"676\\\": 1, \\\"202\\\": 8, \\\"185\\\": 9, \\\"678\\\": 1, \\\"677\\\": 1, \\\"113\\\": 15, \\\"679\\\": 1, \\\"680\\\": 1, \\\"114\\\": 15, \\\"681\\\": 1, \\\"241\\\": 6, \\\"682\\\": 1, \\\"483\\\": 2, \\\"683\\\": 1, \\\"484\\\": 2, \\\"684\\\": 1, \\\"685\\\": 1, \\\"687\\\": 1, \\\"686\\\": 1, \\\"688\\\": 1, \\\"485\\\": 2, \\\"132\\\": 13, \\\"689\\\": 1, \\\"690\\\": 1, \\\"281\\\": 5, \\\"486\\\": 2, \\\"691\\\": 1, \\\"12\\\": 118, \\\"487\\\": 2, \\\"692\\\": 1, \\\"693\\\": 1, \\\"33\\\": 48, \\\"694\\\": 1, \\\"65\\\": 27, \\\"401\\\": 3, \\\"402\\\": 3, \\\"14\\\": 102, \\\"91\\\": 20, \\\"488\\\": 2, \\\"58\\\": 29, \\\"489\\\": 2, \\\"490\\\": 2, \\\"695\\\": 1, \\\"697\\\": 1, \\\"4\\\": 301, \\\"696\\\": 1, \\\"403\\\": 3, \\\"27\\\": 60, \\\"698\\\": 1, \\\"28\\\": 61, \\\"404\\\": 3, \\\"699\\\": 1, \\\"49\\\": 33, \\\"700\\\": 1, \\\"491\\\": 2, \\\"492\\\": 2, \\\"282\\\": 5, \\\"61\\\": 27, \\\"493\\\": 2, \\\"203\\\": 8, \\\"701\\\": 1, \\\"703\\\": 1, \\\"702\\\": 1, \\\"704\\\": 1, \\\"705\\\": 1, \\\"708\\\": 1, \\\"707\\\": 1, \\\"706\\\": 1, \\\"709\\\": 1, \\\"711\\\": 1, \\\"710\\\": 1, \\\"92\\\": 20, \\\"341\\\": 2, \\\"342\\\": 4, \\\"713\\\": 1, \\\"712\\\": 1, \\\"715\\\": 1, \\\"714\\\": 1, \\\"717\\\": 1, \\\"716\\\": 1, \\\"718\\\": 1, \\\"720\\\": 1, \\\"719\\\": 1, \\\"721\\\": 1, \\\"494\\\": 2, \\\"722\\\": 1, \\\"133\\\": 13, \\\"724\\\": 1, \\\"343\\\": 4, \\\"723\\\": 1, \\\"728\\\": 1, \\\"725\\\": 1, \\\"726\\\": 1, \\\"727\\\": 1, \\\"495\\\": 2, \\\"496\\\": 2, \\\"730\\\": 1, \\\"729\\\": 1, \\\"45\\\": 37, \\\"242\\\": 6, \\\"731\\\": 1, \\\"87\\\": 21, \\\"283\\\": 5, \\\"217\\\": 7, \\\"204\\\": 8, \\\"205\\\": 8, \\\"497\\\": 2, \\\"405\\\": 3, \\\"406\\\": 3, \\\"498\\\": 2, \\\"732\\\": 1, \\\"284\\\": 5, \\\"407\\\": 3, \\\"243\\\": 6, \\\"733\\\": 1, \\\"734\\\": 1, \\\"499\\\": 2, \\\"735\\\": 1, \\\"736\\\": 1, \\\"737\\\": 1, \\\"500\\\": 2, \\\"738\\\": 1, \\\"739\\\": 1, \\\"741\\\": 1, \\\"740\\\": 1, \\\"742\\\": 1, \\\"743\\\": 1, \\\"744\\\": 1, \\\"745\\\": 1, \\\"746\\\": 1, \\\"747\\\": 1, \\\"748\\\": 1, \\\"749\\\": 1, \\\"69\\\": 26, \\\"750\\\": 1, \\\"36\\\": 47, \\\"501\\\": 2, \\\"244\\\": 6, \\\"502\\\": 2, \\\"344\\\": 4, \\\"408\\\": 3, \\\"751\\\": 1, \\\"752\\\": 1, \\\"218\\\": 7, \\\"145\\\": 12, \\\"753\\\": 1, \\\"134\\\": 13, \\\"115\\\": 15, \\\"754\\\": 1, \\\"285\\\": 5, \\\"755\\\": 1, \\\"7\\\": 214, \\\"756\\\": 1, \\\"116\\\": 15, \\\"206\\\": 8, \\\"186\\\": 9, \\\"503\\\": 2, \\\"70\\\": 26, \\\"245\\\": 6, \\\"93\\\": 20, \\\"286\\\": 5, \\\"757\\\": 1, \\\"758\\\": 1, \\\"759\\\": 1, \\\"79\\\": 23, \\\"207\\\": 8, \\\"345\\\": 4, \\\"73\\\": 24, \\\"504\\\": 2, \\\"246\\\": 6, \\\"219\\\": 7, \\\"505\\\": 2, \\\"346\\\": 4, \\\"409\\\": 3, \\\"410\\\": 3, \\\"506\\\": 2, \\\"760\\\": 1, \\\"507\\\": 2, \\\"761\\\": 1, \\\"411\\\": 3, \\\"287\\\": 5, \\\"508\\\": 2, \\\"247\\\": 6, \\\"510\\\": 2, \\\"509\\\": 2, \\\"762\\\": 1, \\\"763\\\": 1, \\\"765\\\": 1, \\\"764\\\": 1, \\\"766\\\": 1, \\\"103\\\": 18, \\\"146\\\": 12, \\\"767\\\": 1, \\\"412\\\": 3, \\\"413\\\": 3, \\\"52\\\": 32, \\\"51\\\": 32, \\\"511\\\": 2, \\\"768\\\": 1, \\\"769\\\": 1, \\\"770\\\": 1, \\\"288\\\": 5, \\\"512\\\": 2, \\\"414\\\": 3, \\\"771\\\": 1, \\\"289\\\": 5, \\\"513\\\": 2, \\\"772\\\": 1, \\\"39\\\": 38, \\\"290\\\": 5, \\\"514\\\": 2, \\\"187\\\": 9, \\\"158\\\": 11, \\\"415\\\": 3, \\\"515\\\": 2, \\\"773\\\": 1, \\\"416\\\": 3, \\\"117\\\": 15, \\\"417\\\": 3, \\\"774\\\": 1, \\\"159\\\": 11, \\\"418\\\": 3, \\\"775\\\": 1, \\\"220\\\": 7, \\\"420\\\": 3, \\\"419\\\": 3, \\\"421\\\": 3, \\\"516\\\": 2, \\\"517\\\": 2, \\\"347\\\": 4, \\\"518\\\": 2, \\\"776\\\": 1, \\\"422\\\": 3, \\\"519\\\": 2, \\\"248\\\": 6, \\\"777\\\": 1, \\\"778\\\": 1, \\\"520\\\": 2, \\\"779\\\": 1, \\\"80\\\": 23, \\\"348\\\": 4, \\\"349\\\": 4, \\\"780\\\": 1, \\\"781\\\": 1, \\\"423\\\": 3, \\\"782\\\": 1, \\\"521\\\": 2, \\\"783\\\": 1, \\\"47\\\": 35, \\\"350\\\": 4, \\\"34\\\": 48, \\\"522\\\": 2, \\\"291\\\": 5, \\\"135\\\": 13, \\\"424\\\": 3, \\\"188\\\": 9, \\\"784\\\": 1, \\\"59\\\": 29, \\\"249\\\": 6, \\\"351\\\": 4, \\\"66\\\": 27, \\\"250\\\": 6, \\\"189\\\": 8, \\\"251\\\": 6, \\\"190\\\": 8, \\\"136\\\": 13, \\\"352\\\": 4, \\\"353\\\": 4, \\\"354\\\": 4, \\\"355\\\": 4, \\\"356\\\": 4, \\\"358\\\": 4, \\\"357\\\": 4, \\\"359\\\": 4, \\\"425\\\": 3, \\\"785\\\": 1, \\\"168\\\": 10, \\\"360\\\": 4, \\\"361\\\": 4, \\\"74\\\": 24, \\\"292\\\": 5, \\\"362\\\": 4, \\\"363\\\": 4, \\\"94\\\": 20, \\\"82\\\": 22, \\\"208\\\": 8, \\\"523\\\": 2, \\\"524\\\": 2, \\\"426\\\": 3, \\\"22\\\": 63, \\\"364\\\": 4, \\\"525\\\": 2, \\\"75\\\": 24, \\\"123\\\": 14, \\\"526\\\": 2, \\\"16\\\": 98, \\\"365\\\": 4, \\\"366\\\": 4, \\\"48\\\": 35, \\\"427\\\": 3, \\\"13\\\": 107, \\\"9\\\": 170, \\\"527\\\": 2, \\\"786\\\": 1, \\\"787\\\": 1, \\\"29\\\": 54, \\\"252\\\": 6, \\\"788\\\": 1, \\\"428\\\": 3, \\\"293\\\": 5, \\\"528\\\": 2, \\\"76\\\": 23, \\\"104\\\": 18, \\\"529\\\": 2, \\\"169\\\": 10, \\\"530\\\": 2, \\\"170\\\": 10, \\\"531\\\": 2, \\\"171\\\": 10, \\\"532\\\": 2, \\\"294\\\": 5, \\\"109\\\": 16, \\\"367\\\": 4, \\\"533\\\": 2, \\\"172\\\": 10, \\\"209\\\": 8, \\\"62\\\": 28, \\\"253\\\": 6, \\\"53\\\": 31, \\\"124\\\": 14, \\\"88\\\": 21, \\\"71\\\": 26, \\\"72\\\": 26, \\\"254\\\": 6, \\\"534\\\": 2, \\\"535\\\": 2, \\\"77\\\": 24, \\\"210\\\": 8, \\\"536\\\": 2, \\\"83\\\": 22, \\\"429\\\": 3, \\\"147\\\": 12, \\\"430\\\": 3, \\\"431\\\": 3, \\\"432\\\": 3, \\\"433\\\": 3, \\\"148\\\": 12, \\\"137\\\": 13, \\\"537\\\": 2, \\\"538\\\": 2, \\\"539\\\": 2, \\\"540\\\": 2, \\\"541\\\": 2, \\\"368\\\": 4, \\\"149\\\": 12, \\\"150\\\": 12, \\\"542\\\": 2, \\\"138\\\": 13, \\\"789\\\": 1, \\\"790\\\": 1, \\\"791\\\": 1, \\\"792\\\": 1, \\\"89\\\": 21, \\\"173\\\": 10, \\\"56\\\": 30, \\\"54\\\": 31, \\\"191\\\": 9, \\\"255\\\": 6, \\\"151\\\": 12, \\\"256\\\": 6, \\\"84\\\": 22, \\\"139\\\": 13, \\\"174\\\": 10, \\\"793\\\": 1, \\\"794\\\": 1, \\\"369\\\": 4, \\\"795\\\": 1, \\\"95\\\": 20, \\\"152\\\": 12, \\\"118\\\": 15, \\\"110\\\": 16, \\\"96\\\": 20, \\\"97\\\": 20, \\\"434\\\": 3, \\\"295\\\": 5, \\\"543\\\": 2, \\\"370\\\": 4, \\\"296\\\": 5, \\\"297\\\": 5, \\\"298\\\": 5, \\\"299\\\": 5, \\\"371\\\": 4, \\\"300\\\": 5, \\\"372\\\": 4, \\\"257\\\": 6, \\\"50\\\": 33, \\\"796\\\": 1, \\\"258\\\": 6, \\\"435\\\": 3, \\\"192\\\": 9, \\\"153\\\": 12, \\\"211\\\": 8, \\\"436\\\": 3, \\\"544\\\": 2, \\\"545\\\": 2, \\\"259\\\": 6, \\\"546\\\": 2, \\\"547\\\": 2, \\\"260\\\": 6, \\\"35\\\": 45, \\\"797\\\": 1, \\\"548\\\": 2, \\\"549\\\": 2, \\\"437\\\": 3, \\\"140\\\": 13, \\\"40\\\": 40, \\\"31\\\": 49, \\\"37\\\": 45, \\\"38\\\": 43, \\\"125\\\": 14, \\\"438\\\": 3, \\\"439\\\": 3, \\\"111\\\": 16, \\\"42\\\": 39, \\\"301\\\": 5, \\\"18\\\": 81, \\\"55\\\": 31, \\\"160\\\": 11, \\\"141\\\": 13, \\\"154\\\": 12, \\\"161\\\": 11, \\\"193\\\": 9, \\\"194\\\": 9, \\\"195\\\": 9, \\\"196\\\": 9, \\\"798\\\": 1, \\\"550\\\": 2, \\\"440\\\": 3, \\\"43\\\": 38, \\\"373\\\": 4, \\\"261\\\": 6, \\\"441\\\": 3, \\\"799\\\": 1, \\\"374\\\": 4, \\\"221\\\": 7, \\\"63\\\": 28, \\\"155\\\": 12, \\\"67\\\": 27, \\\"64\\\": 25, \\\"302\\\": 5, \\\"551\\\": 2, \\\"552\\\": 2, \\\"553\\\": 2, \\\"554\\\": 2, \\\"555\\\": 2, \\\"556\\\": 2, \\\"142\\\": 13, \\\"85\\\": 22, \\\"23\\\": 63, \\\"222\\\": 7, \\\"442\\\": 3, \\\"81\\\": 23, \\\"443\\\": 3, \\\"262\\\": 6, \\\"197\\\": 9, \\\"263\\\": 6, \\\"303\\\": 5, \\\"444\\\": 3, \\\"800\\\": 1, \\\"57\\\": 30, \\\"106\\\": 17, \\\"445\\\": 3, \\\"198\\\": 9, \\\"107\\\": 17, \\\"304\\\": 5, \\\"119\\\": 15, \\\"305\\\": 5, \\\"306\\\": 5, \\\"307\\\": 5, \\\"308\\\": 5, \\\"175\\\": 10, \\\"309\\\": 5, \\\"310\\\": 5, \\\"199\\\": 9, \\\"223\\\": 7, \\\"311\\\": 5, \\\"376\\\": 4, \\\"375\\\": 4, \\\"212\\\": 8, \\\"557\\\": 2, \\\"176\\\": 10, \\\"801\\\": 1, \\\"802\\\": 1, \\\"803\\\": 1, \\\"126\\\": 14, \\\"804\\\": 1, \\\"805\\\": 1, \\\"99\\\": 19, \\\"558\\\": 2, \\\"162\\\": 11, \\\"224\\\": 7, \\\"806\\\": 1, \\\"377\\\": 4, \\\"378\\\": 4, \\\"559\\\": 2, \\\"560\\\": 2, \\\"807\\\": 1, \\\"561\\\": 2, \\\"562\\\": 2, \\\"563\\\": 2, \\\"564\\\": 2, \\\"379\\\": 4, \\\"808\\\": 1, \\\"565\\\": 2, \\\"566\\\": 2, \\\"567\\\": 2, \\\"312\\\": 5, \\\"225\\\": 7, \\\"568\\\": 2, \\\"446\\\": 3, \\\"447\\\": 3, \\\"448\\\": 3, \\\"127\\\": 14, \\\"380\\\": 2, \\\"381\\\": 4, \\\"226\\\": 7, \\\"569\\\": 2, \\\"227\\\": 7, \\\"809\\\": 1, \\\"382\\\": 4, \\\"264\\\": 6, \\\"143\\\": 13, \\\"570\\\": 2, \\\"383\\\": 4, \\\"384\\\": 4, \\\"449\\\": 3, \\\"571\\\": 2, \\\"572\\\": 2, \\\"266\\\": 6, \\\"450\\\": 3, \\\"265\\\": 6, \\\"573\\\": 2, \\\"60\\\": 29, \\\"574\\\": 2, \\\"810\\\": 1, \\\"313\\\": 5, \\\"575\\\": 2, \\\"576\\\": 2, \\\"577\\\": 2, \\\"578\\\": 2, \\\"579\\\": 2, \\\"811\\\": 1, \\\"580\\\": 2, \\\"581\\\": 2, \\\"582\\\": 2, \\\"583\\\": 2, \\\"584\\\": 2, \\\"585\\\": 2, \\\"156\\\": 12, \\\"451\\\": 3, \\\"177\\\": 10, \\\"68\\\": 27, \\\"812\\\": 1, \\\"314\\\": 5, \\\"267\\\": 6, \\\"200\\\": 9, \\\"178\\\": 10, \\\"201\\\": 9, \\\"163\\\": 11, \\\"98\\\": 20, \\\"588\\\": 2, \\\"589\\\": 2, \\\"587\\\": 2, \\\"586\\\": 2, \\\"590\\\": 2, \\\"591\\\": 2, \\\"452\\\": 3, \\\"453\\\": 3, \\\"592\\\": 2, \\\"593\\\": 2, \\\"595\\\": 2, \\\"594\\\": 2, \\\"455\\\": 3, \\\"454\\\": 3, \\\"596\\\": 2, \\\"813\\\": 1, \\\"814\\\": 1, \\\"815\\\": 1, \\\"597\\\": 2, \\\"816\\\": 1, \\\"456\\\": 3, \\\"457\\\": 3, \\\"598\\\": 2, \\\"268\\\": 6, \\\"817\\\": 1, \\\"458\\\": 3, \\\"459\\\": 3, \\\"460\\\": 3, \\\"820\\\": 1, \\\"818\\\": 1, \\\"819\\\": 1, \\\"821\\\": 1, \\\"120\\\": 15, \\\"213\\\": 8, \\\"599\\\": 2, \\\"600\\\": 2, \\\"601\\\": 2, \\\"822\\\": 1, \\\"41\\\": 40, \\\"602\\\": 2, \\\"823\\\": 1, \\\"824\\\": 1, \\\"269\\\": 6, \\\"603\\\": 2, \\\"604\\\": 2, \\\"461\\\": 3, \\\"385\\\": 4, \\\"605\\\": 2, \\\"462\\\": 3, \\\"607\\\": 2, \\\"608\\\": 2, \\\"606\\\": 2, \\\"228\\\": 7, \\\"463\\\": 3, \\\"609\\\": 2, \\\"610\\\": 2, \\\"611\\\": 2, \\\"464\\\": 3, \\\"612\\\": 2, \\\"825\\\": 1, \\\"827\\\": 1, \\\"100\\\": 19, \\\"826\\\": 1, \\\"828\\\": 1, \\\"829\\\": 1, \\\"386\\\": 4, \\\"830\\\": 1, \\\"315\\\": 5, \\\"613\\\": 2, \\\"831\\\": 1, \\\"614\\\": 2, \\\"616\\\": 2, \\\"615\\\": 2, \\\"164\\\": 11, \\\"214\\\": 8, \\\"617\\\": 2, \\\"387\\\": 4, \\\"618\\\": 2, \\\"832\\\": 1, \\\"833\\\": 1, \\\"835\\\": 1, \\\"836\\\": 1, \\\"834\\\": 1, \\\"388\\\": 4, \\\"165\\\": 11, \\\"229\\\": 7, \\\"619\\\": 2, \\\"620\\\": 2, \\\"389\\\": 4, \\\"317\\\": 5, \\\"316\\\": 5, \\\"621\\\": 2, \\\"837\\\": 1, \\\"838\\\": 1, \\\"318\\\": 5, \\\"319\\\": 5, \\\"839\\\": 1, \\\"622\\\": 2, \\\"840\\\": 1, \\\"623\\\": 2, \\\"841\\\": 1, \\\"624\\\": 2, \\\"320\\\": 5, \\\"625\\\": 2, \\\"626\\\": 2, \\\"842\\\": 1, \\\"843\\\": 1, \\\"844\\\": 1, \\\"627\\\": 2, \\\"179\\\": 10, \\\"846\\\": 1, \\\"845\\\": 1, \\\"628\\\": 2, \\\"321\\\": 5, \\\"121\\\": 15, \\\"847\\\": 1, \\\"390\\\": 4, \\\"270\\\": 6, \\\"629\\\": 2, \\\"848\\\": 1, \\\"849\\\": 1, \\\"322\\\": 5, \\\"850\\\": 1, \\\"323\\\": 5, \\\"230\\\": 7, \\\"231\\\": 7, \\\"851\\\": 1, \\\"852\\\": 1, \\\"630\\\": 2, \\\"853\\\": 1, \\\"232\\\": 7, \\\"631\\\": 2, \\\"215\\\": 8, \\\"854\\\": 1, \\\"855\\\": 1, \\\"856\\\": 1, \\\"857\\\": 1, \\\"465\\\": 3, \\\"324\\\": 5, \\\"632\\\": 2, \\\"633\\\": 2, \\\"858\\\": 1, \\\"634\\\": 2, \\\"859\\\": 1, \\\"128\\\": 14, \\\"860\\\": 1, \\\"861\\\": 1, \\\"157\\\": 12, \\\"862\\\": 1, \\\"863\\\": 1, \\\"864\\\": 1, \\\"865\\\": 1, \\\"866\\\": 1, \\\"867\\\": 1, \\\"635\\\": 2, \\\"868\\\": 1, \\\"869\\\": 1, \\\"870\\\": 1, \\\"871\\\": 1, \\\"872\\\": 1, \\\"873\\\": 1, \\\"874\\\": 1, \\\"875\\\": 1, \\\"876\\\": 1, \\\"466\\\": 3, \\\"877\\\": 1, \\\"636\\\": 2, \\\"637\\\": 2, \\\"878\\\": 1, \\\"879\\\": 1, \\\"325\\\": 5, \\\"880\\\": 1, \\\"638\\\": 2, \\\"881\\\": 1, \\\"467\\\": 3, \\\"639\\\": 2, \\\"271\\\": 6, \\\"884\\\": 1, \\\"882\\\": 1, \\\"883\\\": 1, \\\"885\\\": 1, \\\"886\\\": 1, \\\"887\\\": 1, \\\"888\\\": 1, \\\"889\\\": 1, \\\"468\\\": 3, \\\"890\\\": 1, \\\"640\\\": 2, \\\"892\\\": 1, \\\"891\\\": 1, \\\"641\\\": 2, \\\"893\\\": 1, \\\"326\\\": 5, \\\"391\\\": 4, \\\"894\\\": 1, \\\"392\\\": 4, \\\"642\\\": 2, \\\"233\\\": 7, \\\"180\\\": 10, \\\"181\\\": 10, \\\"469\\\": 3, \\\"273\\\": 6, \\\"272\\\": 6, \\\"895\\\": 1, \\\"896\\\": 1, \\\"234\\\": 7, \\\"897\\\": 1, \\\"235\\\": 7, \\\"643\\\": 2, \\\"327\\\": 5, \\\"236\\\": 7, \\\"328\\\": 5, \\\"644\\\": 2, \\\"899\\\": 1, \\\"898\\\": 1, \\\"900\\\": 1, \\\"393\\\": 4, \\\"329\\\": 5, \\\"901\\\": 1, \\\"902\\\": 1, \\\"645\\\": 2, \\\"646\\\": 2, \\\"904\\\": 1, \\\"903\\\": 1, \\\"905\\\": 1, \\\"907\\\": 1, \\\"906\\\": 1, \\\"908\\\": 1, \\\"182\\\": 10, \\\"330\\\": 5, \\\"274\\\": 6, \\\"909\\\": 1, \\\"331\\\": 5, \\\"910\\\": 1, 